[{"title":"Test","date_added":"2016-07-07","published":true,"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Bridging the Generational Divide","body_content":"This week, I officiated a funeral. At the funeral I met a man who was celebrating his 90th birthday. This guy was awesome. He was sharp as a tack. He didn't look a day over 70 and he was actually at the funeral because he was working part time for the funeral home.\n\nWe had some time so I talked to him about a good many things. He flew B-25s in World War 2, was a farmer for many years, and had recently taken up the piano. At some point along the way, he told me that he enjoyed playing Elvis songs for his grandchildren.\n\nThen it hit me: *This man was in his thirties before Elvis was even a thing.*\n\n### His life\n\nAs I thought about it some more, I got to think about how many other things he had lived through: He was in his forties during the Vietnam war and hippy age. He was in his sixties before personal computers were a thing and in his seventies before any normal person was on the internet.\n\nThe more I thought about it, the more I thought that this man and those of his generation may have lived through more social changes than any other generation in human history. I've often wondered what it would be like to have your life span the end of slavery, the industrial revolution or the protestant reformation - I think the 20th century might have even been more of a radical shift than even those crazy times.\n\nMany of those changes were good: the end of racism, the explosion of wealth, the onset of easy travel, the spread of information, the eradication of diseases like polio, etc. However, many of those changes were things we would consider bad: a sharp uptick in divorce rates, the rejection of traditional (and biblical) gender roles, the increase in children born out of wedlock, the rise of adolescence and youth culture, the institutionalization of teenaged rebellion - the list could go on and on.\n\n### My Life\n\nFrom that perspective, think about someone like me. I was born in 1983. I never lived in a culture where it was scandalous for a woman to wear pants at Wal-mart or for a man to wear only a t-shirt. 75% of my class in high school had divorced parents. In the broader culture, rock music was never a sign of generational rebellion (my dad played U2 over my cradle.) I was tinkering with computers in grade school and on the internet (albeit the old AOL variety) in middle school.\n\nThis man grew up listening to \"The Shadow\" on the one family radio. I grew up watching Teenaged Mutant Ninja Turtles and Ghostbusters on my own TV in the playroom (When I wasn't playing on the Nintendo or Sega Genesis). This man had the run of the family farm. I was told to stay in the back yard. This man was expected to be married between 21-23 and to father children before 30. I had many well meaning people say \"but you're so young\" when I was married at 23.\n\nTruly the only world I've ever known is completely different than the world he spent most of his life in.\n\n# The Three Groups In Our Churches\n\nWe are truly living at a unique time in human history. Life spans are longer than they have ever been and, coupled with the seismic cultural shift of the last 60 years, it creates a very interesting dynamic.\n\nEssentially, you have three groups in churches today:\n\nFirst, there are those like the man I met the other day who lived most of their lives in \"the good old days.\" I'll call them The Old Timers. Their view of culture tends to be traditional and nostalgic.\n\nSecond, there are those like me who were born after the cultural revolution. Let call them The New Kids. We tend to look at a lot of the cultural changes and have a hard time getting as worked up about them because we've never known anything different.\n\nThird, there are those who make up the transitional generations between the Old Timers and the New Kids. Let's call them The Transitionals. Their perspectives on cultural issues vary widely and whatever their position, they tend to be sympathetic to both The Old Timers and the New Kids.\n\nChances are you have Old Timers, Transitionals and New Kids in your church. Chances are also pretty good that your church has been dominated by Old Timers and the kind of transitionals who were (I think rightly) very slow to accept cultural change. Chances are leadership in your church has either been passed on to someone from my generation or is in the process of being passed on and you are working through what that means.\n\n# What Do We Do?\n\nI wish I could give you some special insight on how to handle this. I can't. I'm still working it out myself. But there are three things I wish all of us would put into practice in our churches when it comes to this generational stuff:\n\n## Recognition\n\nJust recognize that a potential generational struggle is there. Knowing how rapid the culture has shifted, how rare it is for their to be three almost completely different cultures sharing the same church and how vast the generation gap can potentially be helps all three groups not to jump to conclusions.\n\n## Empathy\n\nBefore we as young people jump to conclusions about \"old timers\" lets consider how much social upheaval they've lived through. Let's do our best to give them the benefit of the doubt and to judge them in the light of their generational context.\n\nSimilarly, as one of the New Kids myself, I would beg both the Transitionals and the Old Timers to think about our generational context a little bit. We were not raised in the same world that you were and we cannot be expected to swallow all of the same assumptions about culture that you got by proxy. Instead of losing your minds whenever we see cultural issues differently than you do, expect that and help us see what your experience and accumulated wisdom brings to bear on the subject.\n\n## Respect\n\nThe Bible tells us in no uncertain terms that we are to respect our elders and \"the hoary head.\" We live in a time and culture when age is despised and where some church growth experts straight up call for the input of the Old Timers to be ignored in the name of reaching the next generation. Despite the difficulties that our unique generational context gives us - let's strive to show a great amount of respect and deference for those who went before.","featured_image":[{"id":"attCVxNyTKXKf6Rbj","url":"https://dl.airtable.com/B3u63gTITX6y9a1gDTlg_divide.jpg","filename":"divide.jpg","size":155200,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/K1Vl73PgTkWeTvHHhxnO_small_divide.jpg","width":64,"height":36},"large":{"url":"https://dl.airtable.com/6ZOe8dnnRYSy9LMK6ruG_large_divide.jpg","width":512,"height":315}}}],"categories":["Articles"],"author":["recnX9ksgzaoMmBbf"],"date_added":"2015-12-02","published":true,"author_name":["Pastor Ryan Hayden"],"author_bio":["Ryan Hayden serves as the Senior Pastor at Bible Baptist."],"author_thumbnail":[{"id":"attT35pauT1YG0JO3","url":"https://dl.airtable.com/jBqk5lXUSlSfn0apY81p_thumb.jpg","filename":"thumb.jpg","type":"image/jpeg","size":42497,"width":512,"height":512,"smallThumbUrl":"https://dl.airtable.com/wS7OjSJRZWpM3nIYz1sQ_small_thumb.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/mOHtCKRETheu2QVjImH0_large_thumb.jpg","largeThumbWidth":512,"largeThumbHeight":512}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"The Standards Comparison Trap","body_content":"This week, I’ve already written two articles on the topic of standards:\n\n* [Thinking through standards](http://www.pastorryanhayden.com/fundamentalism/2015/11/17/thinking-through-standards.html)\n* [Dealing with people whose standards are higher or lower than mine](http://www.pastorryanhayden.com/fundamentalism/2015/11/18/dealing-with-people-who-have-higher-or-lower-standards-than-you.html)\n\nMy friend [Jason Wall](https://twitter.com/jasonbwall) had a good point about the title of my last post: The idea of higher and lower (or a sliding scale of left and right) standards really muddies the waters.  I absolutely agree.\n\nJason even provided a graphic illustration of a lady with “higher standards.”\n\n![Lady with standards](https://dl.dropboxusercontent.com/u/47159282/CUITMeIWoAA3VPp.jpg)\n\n# Here is what’s wrong with appealing to the left/right/higher/lower trap:\n\n## It misses the point\n\nIt doesn’t really matter if standards are “higher” or “lower” or if they are “liberal” or “conservative” or if they are “right” or “left” – all that really matters is “are they biblical?”\n\nAny criticism that uses the scale misses the point.  Truth isn’t on a scale.  It’s true or it’s false.  It’s either biblical or it’s not.  If someone has a standard that goes beyond scripture – it’s not wrong because it’s “too high” it’s wrong because it’s not scriptural.  It’s not what God intended.  If someone fails to live up to God’s standard, they aren’t wrong because they have “low standards” they are wrong because they are throwing out or ignoring scripture.\n\n## It’s a dodge\n\n**Most of the time people go to the standard scales they are trying to avoid a trip back to the standard.**  Rather than dealing with the real issue “is this scriptural” they are trying to shut down the discussion with an insinuated attack.  If they can put the questioner on defense, they can get by without answering the question.  \n\n## It’s a slippery slope\n\nIn the minds of a lot of independent Baptist, every inch of ground between their position and full-blown Rick Warren water slide lubricated with baby oil.  When you refuse to examine your standards in the light of scripture because of fear – that doesn’t betray a strong position; it reveals a weak one.  It shows that you have a total lack of confidence in the Word of God and that you aren’t standing on the solid rock of God’s word, you are standing on the wobbling pebble of pride.\n\n## It’s a prison\n\nI really pity those who are trapped in the left/right/higher/lower standards way of thinking because it’s a prison.  No one wants to be the guy with low standards.  No one wants to be the “compromiser.” So this line of thinking inevitably produces a rush to the right irrespective of what the Bible actually teaches.  Well meaning people have a tendency to take God’s laws which are intended for our flourishing and turn them into “heavy burdens that no man can bear.”\n\nWe must remember that when Jesus said *“ye shall know the truth and the truth shall make you free”* He was talking to a group of people who had higher standards than any of us can imagine.  \n\nIf the Bible commands something that is “higher” than your current lifestyle – you’ll find freedom in that.  If the Bible teaches something that is “lower” than your current standards – you’ll find freedom in that.  All that is to be found in comparison is a trap and a prison.","featured_image":[{"id":"attK0rZBTCjl5vnAh","url":"https://dl.airtable.com/qlMRo9d3TaGgXBthSkpW_standards.jpg","filename":"standards.jpg","size":133150,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/iH8BQxrS2K2pZYII3RDk_small_standards.jpg","width":64,"height":36},"large":{"url":"https://dl.airtable.com/B6gIs31xR3ua7GQid99w_large_standards.jpg","width":512,"height":315}}}],"categories":["Articles"],"author":["recnX9ksgzaoMmBbf"],"date_added":"2015-11-20","published":true,"author_name":["Pastor Ryan Hayden"],"author_bio":["Ryan Hayden serves as the Senior Pastor at Bible Baptist."],"author_thumbnail":[{"id":"attT35pauT1YG0JO3","url":"https://dl.airtable.com/jBqk5lXUSlSfn0apY81p_thumb.jpg","filename":"thumb.jpg","type":"image/jpeg","size":42497,"width":512,"height":512,"smallThumbUrl":"https://dl.airtable.com/wS7OjSJRZWpM3nIYz1sQ_small_thumb.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/mOHtCKRETheu2QVjImH0_large_thumb.jpg","largeThumbWidth":512,"largeThumbHeight":512}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"People With Higher or Lower Standards","body_content":"Someone suggested that I write a follow up post to yesterday’s post on standards that talks about how to handle those with either stricter or looser standards than I personally hold.  I’m no expert on it, but it is something that I deal with every week and I imagine most Christians are in the same boat.\n\nIt’s my opinion that you deal with folks with a different standard on a case by case basis.  Essentially, whether they have more standards than I or less, there are only three cases I deal with and each one is handled differently:\n\n## 1.Those who have thought through their standards.\n\n### Response: respect\n\nI have some friends who have worked through their position on standards.  They have thought through the point, source, use and cost of the standards they have adopted and come to a different conclusion than I.  Some of them are far more “conservative” than I am and some of them are far more “liberal” than I am, but in both cases I respect them.\n\nPeople who have thought through their position don’t tend to be defensive.  They don’t tend to see questions as attacks.  They welcome the challenge of thinking and talking about them and they tend to be patient with people who don’t agree with them.\n\nI respect guys like Kent Brandenburg and Bobby Mitchell, even though they are more conservative on some issues than me, because they’ve thought through their positions and don’t default to a hissy fit any time someone questions them.  On the flip side, I have local friends who don’t share my standards (on alcohol or Bible versions for example) and I respect them because they’ve thought through it.\n\n## 2.Those who haven’t thought through their standards and are cordial about it.\n\n### Response: patience and instruction\n\nMost people I meet are in this category, even though they probably don’t know it.  They aren’t jerks.  Most of the time they are probably doing what they are doing with pure motives.  They just haven’t thought through it.\n\nThe apostle Paul asked the Corinthian believers “For who maketh thee to differ from another? and what hast thou that thou didst not receive? now if thou didst receive it, why dost thou glory, as if thou hadst not received it?” In other words, all of us are building on other people’s foundations.  All of us have to thank God for the position we are in.  It’s a dangerous thing to look down on others for their position without taking into account that, probably, much of that position (like ours) was shaped by their context.  In other words, they didn’t choose the church they were saved in, the part of the country they lived in, who their influences are.  All of that is providential and it makes a HUGE impact on their beliefs. Very often, when people haven’t thought through an issue and yet have a position on it, they are being manipulated by someone else and don’t realize it.  Remembering this makes it easier to be patient with people.\n\nWhen it comes to talking to these people, I generally take it very, very slow.  Also, I’m careful to not flaunt my looser standards (if theirs are stricter) or browbeat them with my stricter standards (if theirs are looser).  I preach the scripture and let the Holy Spirit do His work in their hearts.\n\n## 3.Those who haven’t thought through their standards and are a jerk about it.\n\n### Response: Pity\n\nUnfortunately, there are many people who have very simplistic reasons for why they do what they do and they are straight up mean about it.  They either look down on you for being too loose or look down on you for being too strict.  They are quick with words like “liberal” and “compromiser” or, if they are on the other end of the spectrum “legalist.”\n\nIt’s my opinion that most of the time this type of person is struggling with insecurity.  Not only are they not thinking for themselves, they CAN’T think for themselves or (in their mind) their entire world would crumble around them.  Almost always these people are either manipulated by others, or are manipulating others and are afraid that would come to light.  Their belief system is built on such a shaky foundation that it cannot endure even the slightest wind of questioning so they set up like a sentry and shoot at anyone who even comes close.\n\nI don’t hate such people, I pity them.","featured_image":[{"id":"attFGivPsGhqmZ8GT","url":"https://dl.airtable.com/iG7s9q21QoaF47sKbz9c_standards.jpg","filename":"standards.jpg","size":133150,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/8taVFfVrTUedPaQa2kbG_small_standards.jpg","width":64,"height":36},"large":{"url":"https://dl.airtable.com/EUo2kyiQ4OHCWmE5PbXQ_large_standards.jpg","width":512,"height":315}}}],"categories":["Articles"],"author":["recnX9ksgzaoMmBbf"],"date_added":"2015-11-18","published":true,"author_name":["Pastor Ryan Hayden"],"author_bio":["Ryan Hayden serves as the Senior Pastor at Bible Baptist."],"author_thumbnail":[{"id":"attT35pauT1YG0JO3","url":"https://dl.airtable.com/jBqk5lXUSlSfn0apY81p_thumb.jpg","filename":"thumb.jpg","type":"image/jpeg","size":42497,"width":512,"height":512,"smallThumbUrl":"https://dl.airtable.com/wS7OjSJRZWpM3nIYz1sQ_small_thumb.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/mOHtCKRETheu2QVjImH0_large_thumb.jpg","largeThumbWidth":512,"largeThumbHeight":512}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Thinking Through Standards","body_content":"As a pastor, I am constantly aware of the fact that I have the ability to place burdens on people.  When I, through the preaching of the word or through church policy, establish a standard in my church I am reaching into the lives of faithful people and could lead them to do things God never intended for them to do.  So it's my conviction that I have a responsibility to think through every standard and make sure it is biblical.\n\nThis isn't a post against standards.  It's not my goal to eradicate \"Bible Standards\" with this post.  This post attempts to be \"standards agnostic.\"  In other words, if you follow this through it will confirm some standards and repudiate others.  No matter the position you come to, you'll be \"ready to give an answer\" better for having thought all the way through it and this post is nothing more than a help in that.\n\nWhat follows are the questions I work through in my mind when we are discussing a Christian  standard.  For the sake of an example, I'm going to use the admittedly ridiculous and little held idea that its wrong for Christian men to grow a beard. (Because it is an easy and relatively non-controversial target and because I recently started wearing a beard.)\n\n# Four  questions to ask about standards:\n\nAt a minimum, if you are going to hold to a standard, you should at least be able to think through and articulate these four questions:\n\n## 1.What's the point?\n\nI don't mean that in the way a rebellious teenager might ask it. (Like, \"what's the point of these study halls anyway?\")  I mean we should ask “if this really comes from God, what are His intentions?\"\n\nTwo things are abundantly clear in scripture:\n\nFirst, God's rules are not arbitrary.  Although He has every  right to say “because I said so.” His commands for us are never without reason.\n\nThe second thing that God makes plain to us in scripture is that He isn't trying to enslave us or burden us.  His laws are for His glory and our flourishing.  When we follow them He is glorified but it also brings joy into our lives.  By following the will of the Creator of the universe, things work out better for us.\n\nSo let's say that I'm considering the notion that God is against facial hair.  Why?  Why would God create men with hair growing out of their chins if He expects us to shave it off every day?  How would that aid human flourishing? How does that reflect the glory of God?\n\nThis is basically just asking \"why?\" and at the very minimum we should have this one down, but we shouldn't stop there...\n\n \n\n## 2.What’s the source?\n\nThis is related to the first question.  Another way of saying this is “where did this standard come from?”\n\n### Scripture\n\nThis is the simplest case.  Back to the beard example: is there anything in scripture forbidding men from growing beards?  No. Jesus had a beard.  There is Old Testament law that seems command that Jews had a beard.  At least in the case of beards – the Bible gives us nothing to support forbidding them.\n\nBut let's say that it did.  Let's say that there is a verse in Deuteronomy or Leviticus that forbids beards.  Even then it's not open and shut.  Does that particular scripture apply today?  Is it something God intended for another dispensation?  Is it part of the law we are no longer under?  Is it further clarified in the New Testament?\n\n### History\n\nAnother possible source of a standard is history.  In our ridiculous beard example it seems that the reason fundamentalists were against beards was a combination of the military standards of the WWII generation and a strong reaction to the hippie movement.  Sometimes, at a particular moment in history, an otherwise harmless behavior is so associated with wickedness that there is a movement to stand against it.\n\n### Culture\n\nSome standards make sense in one cultural context.  For example, in the Middle East where there is a cultural expectation for woman to cover their head, it may make sense to adopt that standard (as it seems Paul did on that context) whereas it makes little sense in an American cultural context.\n\nStandards that are attached to cultural contexts can't be seen as set in stone because culture isn't set in stone.  At some point in our recent history t-shirts were considered underwear.  Today, I’ve been to more than one funeral where a majority of the attendees were wearing t-shirts.  For good or bad, culture changes and with it the definition of appropriate.\n\n## 3.What's the use?\n\nIn other words “what possible benefit is to be gained by employing this standard?”\n\nAssuming that the standard in question is not specifically mandated by the scriptures (in which case our discussing should end and our obeying begin) what are we trying to accomplish with this standard?  Are we doing this for protection?  Are we doing this for uniformity? Are we doing this for distinction?  Are we doing this as an attempt to drop an anchor in the storms of cultural change?\n\nIn my experience a lot of people who hold certain standards as sacrosanct either can’t answer this very basic question or give very weak and simplistic answers.\n\nIt’s important that we are very clear on this.  If we are running a Christian high school, and the reason we have a rule against beards is because we don’t want our high school boys to look sloppy and because half of them can’t grow a beard in the first place – let’s clearly communicate that as the reason.  If we think women should wear skirts to church because we think the visible display of accepting our gender differences honors God – then let’s clearly communicate that.\n\n## 4.What's the cost?\n\nIn other words “what are the possible negative repercussions of adopting this standard?”  Here are some of the questions I think we have to ask:\n\n### Can it hijack our emphasis?\n\nI have personally been told by pastors, more than once, that “the emphasis of my church is on standards.”  Regardless of your view of standards, you have to acknowledge that the emphasis of the New Testament isn’t on standards.  Even if you think standards are incredibly important, you have to admit they pale in importance to the importance of Jesus Christ.\n\n### Can it replace the scriptures?\n\nWe all know people (good but simple minded) who have essentially replaced their bible with a checklist.  They think of themselves as good Christians because they don’t do such and such and do such and such.  Standards have a sneaky way of becoming our message and just like they make a poor replacement for emphasizing Christ, they make a poor abridgement of the scriptures.  We have to realize that if a standard isn't crystal clear in scripture, every second we spend defending or teaching it is a second we are not teaching and preaching the Word of God.\n\n### Do we want to be known for this?\n\nIn our town the biggest church is the Apostolic Center and they are known for how their ladies dress.  I’m not saying there is anything wrong with that, I just think we have to ask ourselves “is this something we want to be known for?”\n\n### Will it be a burden on people?\n\nWhen Jesus challenged the Pharisees about some of their Sabbath observance rituals, he made it clear that in their zealousness for that law - they had taken something meant to be refreshing and turned it into a burden.  It's entirely possible for us to do the same in other areas.\n\n### Will it have a snowball effect?\n\nI think an over-zealousness for what probably started out as necessary institutional standards (in Christian schools) drove a huge percentage of my generation out of church.  If the \"what's the use\" is protective, we aren't protecting our kids by inciting them to rebellion.\n\n---\n\n# Conclusion\n\nI'm not against standards.  Some standards are necessary.  Frankly, there are standards I need to make a bigger deal about in my church.  But I think when we approach standards, like everything else, we should think through them.  Hopefully these questions stir your thinking and help confirm what's right and shed light on what's wrong.\n\n \n","featured_image":[{"id":"attGmT8zVRa7SxyNG","url":"https://dl.airtable.com/XuXBBgg8T0WL1aMhViRY_standards.jpg","filename":"standards.jpg","size":133150,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/tnXyjBgCSpinw1lPrP9Y_small_standards.jpg","width":64,"height":36},"large":{"url":"https://dl.airtable.com/Uc0CYYkS9SmbeGwLwJPg_large_standards.jpg","width":512,"height":315}}}],"categories":["Articles"],"author":["recnX9ksgzaoMmBbf"],"date_added":"2015-11-15","published":true,"author_name":["Pastor Ryan Hayden"],"author_bio":["Ryan Hayden serves as the Senior Pastor at Bible Baptist."],"author_thumbnail":[{"id":"attT35pauT1YG0JO3","url":"https://dl.airtable.com/jBqk5lXUSlSfn0apY81p_thumb.jpg","filename":"thumb.jpg","type":"image/jpeg","size":42497,"width":512,"height":512,"smallThumbUrl":"https://dl.airtable.com/wS7OjSJRZWpM3nIYz1sQ_small_thumb.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/mOHtCKRETheu2QVjImH0_large_thumb.jpg","largeThumbWidth":512,"largeThumbHeight":512}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Levels of Preaching Authority","body_content":"I’m currently working on a homiletics curriculum for lay preachers and sunday school teachers. As a part of that, I’ve been going back through some of my favorite books on preaching and rereading them. Today, in Wayne McGill’s 12 Essential Skills for Great Preaching - I was reintroduced to the concept of levels of biblical authority. McGill gives four levels and defines only two - but I thought I would expand on them and give six:\n\n## 1. Direct Biblical Authority\n\nA sermon can be said to have direct biblical authority when the main idea of the sermon is the main idea of the text from which it is derived.\n\n## 2. Indirect Biblical Authority\n\nA sermon can be said to have indirect biblical authority when the main idea of the sermon is a secondary idea of the text from which it is derived.\n\n## 3. Casual Biblical Authority\n\nA sermon can be said to have a casual biblical authority when the main idea or ideas of the sermon are based loosely on a biblical theme derived from all of scripture.\n\n## 4. Corrupted Biblical Authority\n\nA sermon can be said to have corrupted biblical authority when the main idea of the sermon is based on a misinterpretation of the text from which it is derived.\n\n## 5. Replaced Biblical Authority\n\nWhen no attempt is made to connect the sermon to the Bible - the authority of the sermon doesn’t come from scripture - but from the personality or position of the speaker.\n\n## 6. Fuzzy Biblical Authority\n\nThe sermon has no discernible point and thus cannot be tied to the scripture or even a personality or position.\n\n### Takeaways\n\nI think this helps us to remember several things about our preaching:\n\n* The authority of good preaching is derived from the Bible.\n* The further you get from the Bible, the less authoritative your message becomes.\n* The further away you get from (#1) direct biblical authority, the more subjective your sermon becomes and the greater your chances of making an anti-biblical point.\n* Unfortunately, we hear (and even read in sermon periodicals) way too much 3-6 preaching.\n* If we aren’t clear about what our point is, the people who hear us won’t be either and our sermon will have no authority.\n","featured_image":[{"id":"attNRQahkLTEjkze0","url":"https://dl.airtable.com/GOephgLNTvuoG828oQKa_blog.jpg","filename":"blog.jpg","size":118736,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/sAr3Tc3T5uxej7XubVmB_small_blog.jpg","width":64,"height":36},"large":{"url":"https://dl.airtable.com/330mqYzwRBOEr1itw0ZU_large_blog.jpg","width":512,"height":315}}}],"categories":["Articles"],"author":["recnX9ksgzaoMmBbf"],"date_added":"2015-06-23","published":true,"author_name":["Pastor Ryan Hayden"],"author_bio":["Ryan Hayden serves as the Senior Pastor at Bible Baptist."],"author_thumbnail":[{"id":"attT35pauT1YG0JO3","url":"https://dl.airtable.com/jBqk5lXUSlSfn0apY81p_thumb.jpg","filename":"thumb.jpg","type":"image/jpeg","size":42497,"width":512,"height":512,"smallThumbUrl":"https://dl.airtable.com/wS7OjSJRZWpM3nIYz1sQ_small_thumb.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/mOHtCKRETheu2QVjImH0_large_thumb.jpg","largeThumbWidth":512,"largeThumbHeight":512}],"ten_minutes":0,"updated_or_created_ten_minutes":0}]
