[{"title":"The Breakup","body_content":"\n# Title: The Breakup\nJuly 10, 2016\n\n### Text: \n\nActs 15:36-41\n\n---\n### Outline\n#### Lessons:\n#### 1. Saved people aren't perfect. (even apostles)\n#### 2. Conflicts happen. (even with godly people)\n#### 3. Sometimes both people are right. (even though they can't see it at the time.)\n#### 4. God is sovereign (Even in conflicts.)\n#### 5. When we make mistakes, God isn't finished with us (Even if other people are.)\n#### 6.  God can put it back together (even after a blowup.)\n---\nI love to read biographies.  I read a lot of them.  I'm reading one right now about a missionary to the middle east.  Do you know what I hate though?  I hate reading a biography that makes a person out to be faultless.  I've read many biographies where the author's intent wasn't to tell the story of someone's life - it was to make that person some kind of larger-than-life saint.  The fancy word for that is \"hagiography.\"  I hate hagiography.\n\nDo you know why? \n\nBecause no one is really like that.  No.  One.\n \nIf you actually knew Abraham Lincoln or George Washington or Amelia Earhart  or Charles Spurgeon or whoever - you might think they were kind of a jerk. Of maybe they smelled funny.  Or maybe they couldn't match their clothes.  Or maybe they had weird habits.  Because no one is perfect.\n\nOne of the things I love about the Bible is that it doesn't give us hagiography.  When it tells us about men, it portrays them as men.  Not as giants.  Not as statues of perfection.  Men.  It tells us about David's adultery, his parental failures, and his failed marriages.  It tells us about Moses' temper and his rough relationship with his wife.  It tells us about Esther's reluctance to rush into the throne room for her people.  It tells us about Peter's denial of Christ and when Paul had to confront him because he was being hypocritical.  It gives us people lumps and all.\n\nOur story this morning is a great reminder of that.  Truthfully, if I were writing this - I don't know that I would give this detail - but I didn't write it, God did, and He did it for our learning.\n\nLet's read Acts 15:36-41 with me:\n\n> *\"[Act 15:36-41 KJV] 36 And some days after Paul said unto Barnabas, Let us go again and visit our brethren in every city where we have preached the word of the Lord, [and see] how they do. 37 And Barnabas determined to take with them John, whose surname was Mark. 38 But Paul thought not good to take him with them, who departed from them from Pamphylia, and went not with them to the work. 39 And the contention was so sharp between them, that they departed asunder one from the other: and so Barnabas took Mark, and sailed unto Cyprus; 40 And Paul chose Silas, and departed, being recommended by the brethren unto the grace of God. 41 And he went through Syria and Cilicia, confirming the churches.\"*\n\nThis story is pretty simple, it doesn't take a lot of explanation.  So far, Paul and Barnabas - or really Barnabas and Paul - have been going around starting churches and evangelizing the lost.  They are the dynamic duo. The first missionaries.\n\nPaul is the super-educated persecutor turned super-missionary.\nBarnabas, the Levite, is the encouraging, godly guy willing to do anything for the cause of Christ.\n\nThey seem like they are inseperable.  Like they are going to last forever.  Then Acts 15 happens and we are like \"I didn't see that coming.\"\n\nIt's like batman and robin or the lone ranger and tonto have a breakup.  No one expects it.  It's like Kevin Durant going to Golden State.  No one sees it coming and it isn't going to be a pretty split.\n\nHere is what happened:  \n\nThe decided it was time to go back and visit the churches they had started. \n\nGreat.  All good.  No problem.  Let's do it.\n\nSo Barnabas says, let me go get my cousin John Mark and we'll bring him along again.\n\nAnd Paul says \"No.  Way.  Don't you remember what happened last time.  He abandoned us.  I'm not bringing that flake with us again.  What if we get in a tight spot, is he going to abandon us again.  We are better off without him.\"\n\nAnd Barnabas says \"I really think we should bring him\" \n\nAnd Paul says \"No.  Not going to happen.\"\n\nAnd they Bible says:\n\n> *\"And the contention was so sharp between them, that they departed asunder one from the other:\"*\n\nThey blew up and then they broke up.\n\nPaul picked a new partner - Silas and Barnabas took John Mark and they split up and went different ways and just like that it was over.\n\nNow, this is in the Bible.  It's in there for a reason.  What does God want us to learn from it?  Let me give you six lessons.\n\nThe first one is this:\n\n## 1. Saved people aren't perfect. (even apostles) \n\nIsn't it kind of shocking to see this about the apostle Paul?  We love the apostle Paul.  He is a great Christian man.  Maybe the greatest Christian man in the bible.  \n\nAnd then Barnabas.  Barnabas was such an encourager.  Remember, it was Barnabas who went and got Paul when no one else at Jerusalem trusted him.  When everyone thought he was a spy.  Barnabas was the one who vouched for Paul.  He was the encourager.  The nice guy.\n\nYet, it turns out, both of these guys seem pretty hard headed here.  You would think that after all they had gone through they should be able to work something out - to make some kind of compromise - but no.  They didn't.  They blew up.\n\nAnd to me, this is just a reminder that **the best of men are men at best**.  Nobody's perfect.  Everyone has their lumps.  Everybody has their quirks.\n\nYou here people talk sometimes about \"the perfect church\" - there are no perfect churches because their are no perfect people.  If this church was perfect it stopped being perfect when you got here. I could say that about anybody in here.\n\nYou here ladies sometime talk about finding \"the perfect man\" - mr. right.  But are they Miss right? If they are honest they'd say no.  Nobodies perfect.  \n\nNow, listen - that's no excuse for us to not TRY to be.  That's not to be an excuse.  But it should be our expecation.  David said in Psalm 39:4\n\n> *\"LORD, make me to know mine end, and the measure of my days, what it is; that I may know how frail I am.\"*\n\nWe are all frail.  All flesh.  All imperfect.\n\nA second lesson we can learn from this is...\n\n## 2. Conflicts happen. (even with godly people)\n\nMy pastor and boss back in Tennessee served the same church for over 40 years. He would always joke that he had started 8 churches in the Athens, TN area - none on purpose.  Conflicts.\n\nI've met people here.  In Mattoon. Baptists.  Christians.  Who are still mad about stuff that happened 40 years ago.  Conflicts.\n\nConflicts happen.  Conflicts will always happen.  It's part of being a human being.  Anytime you have two people with two wills and you put them together in one place you are going to have conflict.\n\nNow, there are certainly things we can do to avoid conflicts - but we'll never make them go away altogether.\n\nThe third lesson I think we can take from this might surprise you:\n\n## 3. Sometimes both people are right. (even though they can't see it at the time.)\n\nYou see.  Think this through with me.  \n\nLook at it from Paul's perspective: They are doing great work.  It's dangerous.  They are being thrown in jail and risking their life and visiting hostile people.  John Mark has already abandoned them.  It's just not wise to take him with them again.\n\nThat makes sense - right?\n\nNow, look at it from Barnabas' perspective: John Mark is a godly young man. He wants a second chance.  Maybe he needs an encouragement.  He knows what to expect.  He's not going to do it again so easily.  He already knows the ropes.  Aren't we supposed to be \"forgiving one another and forbearing one another?\"  Wasn't it Paul that said that?\n\nThat makes total sense too.\n\nI think they were both right.  Both had good points.\n\nChurch, one of the wisest things we can learn is that when their is a conflict - it's not a zero sum game.  It's not a win-lose thing.  It's not always \"one of us has to be right.\"  Sometimes, both of us can be right and some yielding has to happen. \n\n`<rabbit-trail>`\nCan I veer off subject for a second and say something I think is related and very important:\n\nWe are totally losing the ability to have any kind of conversation in our country.  We've totally stopped trying to compromise with people who don't agree with us. We've totally lost the ability to empathize with others at all and to think about where they are coming from.\n\nLook - we've had a rough week in this country.  The two black men who were shot by police on camera.   We don't know the details yet - but it looks bad. Then the dozen police officers who were shot in Dallas.  We've had the major party nominee absolutely excoriated by the head of the FBI.  We've had mass shootings.  \n\nI remember watching a documentary about the end of the 60s: The race riots, the riots at the conventions, the assassinations - and I thought \"Man, I'm sure glad I wasn't there.\"  Well, we are there now church.  We are there now.\n\nAnd do you know what we need?  Do you know what we desperately need.  We need people who can see others through God's eyes.  Not as democrats or republicans or as blacks or whites, but as people Jesus died for.  As fellow fallen human beings who are right about somethings and wrong about somethings.  As people who need a savior.\n\nSorry.  Rabbit trail over. `</rabbit-trail>`\n\nBack to the point -conflicts are going to happen. Sometimes there isn't a right party.\n\nLet's move on to the fourth point - and from here on out it is a lot more encouraging:\n\n## 4. God is sovereign (Even in conflicts.)\n\nDo you know what happened here?  Two good people had a breakup.\n\nDo you know what else happened in this story?  God took one missionary team and turned it into two.\n\nMaybe, just maybe, this conflict was God's way of moving these people apart so that He could do more with them seperately.\n\nYou know, when an eagle is teaching it's babies to fly - it will take their nest, which is really comfortable, and start turning up the twigs and sticks so that it's uncomfortable to prod them out.  Some people need to do that to their grown children.  \n\nI think God is big enough that maybe He was twisiting some twigs in the Paul-Barnabas nest so that He could better use them both elsewhere.  \n\nLook, you might have to deal with conflicts today and they might not be pleasant but someday you'll be able to look back and sing \"my father planned it all.\"  God is sovereign.  Just trust Him.\n\nThe fifth lesson from this story is just as encouraging:\n \n## 5. When we make mistakes, God isn't finished with us (Even if other people are.)\n\nSo the man at the middle of this story was Barnabas' cousin - John Mark.  John Mark abandoned Paul and Barnabas on their first missionary journey.  He blew it.  Paul didn't want to go back out with him.\n\nBut this isn't the last we hear about John Mark.  Not by a long shot.  God wasn't done with John Mark yet.  In fact, John Mark had the privilege of penning one of the gospels.  The book of Mark.\n\nLook, sometimes in life we make mistakes.  Big mistakes.  We blow it.  But that doesn't mean God is done with us, it doesn't mean that God can't use us.\n\nIt was after Moses killed an Egyptian man in anger that God used him to write most of the Old Testament and lead his people out of Egypt.  It was after Jacob deceived his father and father in law that God gave him the honor of being called \"Israel.\"  It was after Peter blew it at Christ's crucifixion that he became the leader of the apostles.\n\nPeople might be ready to cast you off - but that doesn't mean God is done with you.\n\nOne more lesson and we'll be done, and I think I've saved the best for last:\n\n## 6. God can put it back together (even after a blowup.)\n\nTo get the coolest part of this whole story you have to turn to the last book that the apostle Paul wrote - when he was very near to dying. Turn to 2 Timothy with me and look at 4:11.  Notice what Paul says here:\n\n> *\"Only Luke is with me. Take Mark, and bring him with thee:for he is profitable to me for the ministry\"*\n\nHere, Paul is at the end of his ministry.  He's in a jail cell.  He's facing death.  Most people have abandoned him.  Who does he call for?  Who does he ask for by name?\n\nYes. John Mark.\n\nNow listen, how about you?  Is there anybody who you've had a conflict with and the relationship is strained?  It doesn't have to be. God's big enough to fix it.\n\n# Conclusion\n\nAn old preacher once said\n\n> To dwell above with saints I love, that will be glory.  To dwell below with saints I know - now that's another story.\n\nWe laugh at that - but the truth is conflict is just a part of it.  We are commanded to forgive each other, to forbear each each other, to love each other and help each other - but sometimes we just can't stand each other.\n\nChurch, we just have to trust God to heal those strained relationships.\n\nI heard a preacher say once\n\n> God isn't please with broken relationships.\n\nThat's stuck out to me for a long time.\n\nMaybe you've let someone down.  You've been a John Mark.  You've never apologized.  Let me tell you God can still use you.  He's not finished with you yet.  God can repair that relationship too.  Just trust Him.\n\nMaybe there is someone out there you need to forgive.  Maybe there is someone out there you need to ask forgiveness to.  Take care of it today.\n\nLet me close by saying one more thing.  All of us let someone down - all of us deliberately let down God.  We broke that relationship.  And He loved us so much that He sent His only son to die on the cross for our wrongs, and He wants to forgive us and restore that relationship.  Trust Him today.\n\nLet's stand for invitation and prayer.\n\n","sermon_mp3":[{"id":"attTBvWiOEXESedz5","url":"https://dl.airtable.com/deT6FfCS3u4tKXa9Qp5l_2016%200710%20sun%20am.mp3","filename":"2016 0710 sun am.mp3","size":16355328,"type":"audio/mp3"}],"series":["recimYIKOri1oFH5g"],"service":"Sunday AM","date":"2016-07-10","bible_text":"Acts 15:36-41","speaker":["reczJXlkg63judAaw"],"published":true,"speaker_name":["Ryan Hayden"],"speaker_bio":["Ryan Hayden has served as the pastor at Bible Baptist since 2011.  He loves simple, direct, Bible based preaching.  He blogs at pastorryanhayden.com and is the host of the podcast \"The Foolishness of Preaching\" as well as a daily devotional radio show."],"speaker_role":["Pastor"],"speaker_thumbnail":[{"id":"attiOBQEp50XuGPhA","url":"https://dl.airtable.com/LJGYxDMRxuJNDVwB8peA_Photo%20on%205-10-16%20at%206.26%20PM.jpg","filename":"Photo on 5-10-16 at 6.26 PM.jpg","type":"image/jpeg","size":52652,"width":375,"height":375,"smallThumbUrl":"https://dl.airtable.com/BvvqdOhNTveYIc1lb8fP_small_Photo%20on%205-10-16%20at%206.26%20PM.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/alezlQj3Qdm6UQIO2DQR_large_Photo%20on%205-10-16%20at%206.26%20PM.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"series_title":["Acts"],"series_description":["On Sunday mornings at Bible Baptist we are looking at the story of the first church and their expansion from a small group of people in Jerusalem to a worldwide movement."],"series_featured_image":[{"id":"attD0DHqFH8EMvReu","url":"https://dl.airtable.com/a2NVzZDAS1S6xmXrofvJ_Acts.jpg","filename":"Acts.jpg","type":"image/jpeg","size":751004,"width":1920,"height":1080,"smallThumbUrl":"https://dl.airtable.com/SaeGMTSM6CPhD1R0dp0A_small_Acts.jpg","smallThumbWidth":64,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/i4y4njq3Tqeo3McczRC9_large_Acts.jpg","largeThumbWidth":256,"largeThumbHeight":144}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Your Reward","body_content":"\n# Title: Your Reward\nJuly 10, 2016\n\n### Text: \n\nGenesis 15\n\n---\n### Outline\n\n#### 1. The Problem:\n##### A. Fear of powerful enemies.\n##### B. Fear of empty promises.\n#### 2. The answer:\n##### A. The Shield.\n##### B. The Exceeding Great Reward.\n#### 3. The promise:\n#### 4. The response:\n\n---\n\n\nTonight, I'm back in Genesis.  I've been back for weeks, but I haven't got back in Genesis yet.  Tonight we are going to look at one of my favorite passages in this chapter.  Let's read chapter 15 together:\n\n> *\"1 After these things the word of the LORD came unto Abram in a vision, saying, Fear not, Abram: I [am] thy shield, [and] thy exceeding great reward. 2 And Abram said, Lord GOD, what wilt thou give me, seeing I go childless, and the steward of my house [is] this Eliezer of Damascus? 3 And Abram said, Behold, to me thou hast given no seed: and, lo, one born in my house is mine heir. 4 And, behold, the word of the LORD [came] unto him, saying, This shall not be thine heir; but he that shall come forth out of thine own bowels shall be thine heir. 5 And he brought him forth abroad, and said, Look now toward heaven, and tell the stars, if thou be able to number them: and he said unto him, So shall thy seed be. 6 And he believed in the LORD; and he counted it to him for righteousness. 7 And he said unto him, I [am] the LORD that brought thee out of Ur of the Chaldees, to give thee this land to inherit it. 8 And he said, Lord GOD, whereby shall I know that I shall inherit it? 9 And he said unto him, Take me an heifer of three years old, and a she goat of three years old, and a ram of three years old, and a turtledove, and a young pigeon. 10 And he took unto him all these, and divided them in the midst, and laid each piece one against another: but the birds divided he not. 11 And when the fowls came down upon the carcases, Abram drove them away. 12 And when the sun was going down, a deep sleep fell upon Abram; and, lo, an horror of great darkness fell upon him. 13 And he said unto Abram, Know of a surety that thy seed shall be a stranger in a land [that is] not theirs, and shall serve them; and they shall afflict them four hundred years; 14 And also that nation, whom they shall serve, will I judge: and afterward shall they come out with great substance. 15 And thou shalt go to thy fathers in peace; thou shalt be buried in a good old age. 16 But in the fourth generation they shall come hither again: for the iniquity of the Amorites [is] not yet full. 17 And it came to pass, that, when the sun went down, and it was dark, behold a smoking furnace, and a burning lamp that passed between those pieces. 18 In the same day the LORD made a covenant with Abram, saying, Unto thy seed have I given this land, from the river of Egypt unto the great river, the river Euphrates: 19 The Kenites, and the Kenizzites, and the Kadmonites, 20 And the Hittites, and the Perizzites, and the Rephaims, 21 And the Amorites, and the Canaanites, and the Girgashites, and the Jebusites.\"*\n\nThis is an interesting chapter.  It's a very important chapter.  It's the basis for much of what we see in the Paul's writings about faith.  \n\nIt's a chapter with a lot of firsts: \n\n* It's the first time in the bible you see the phrase \"The word of the Lord came.\"  Now, you are going to see it a lot later - but this is the first reference to the word of the Lord.   \n* It's the first time in the Bible you see God referred to as a shield.  Again, you see that a lot in the scripture - about 20 times.  We sing about how God is a mighty fortress.  That idea starts  in this chapter.\n* It's the first time that a person is commanded to \"fear not\" in the Bible.  That command appears 63 times in the Bible, more than any other command and it is found first here.\n\nBut probably the most important thing we see first in this passage is the word **\"believe\".**\n\nAbraham is called \"the father of faith\" for a reason.  In the New Testament, when Paul was making his case for salvation by faith he said \n\n> \"For what saith the scripture? Abraham believed God, and it was counted unto him for righteousness.\"\n\nBelieved.  That's an important part of it.  So this is a special chapter.  We are just going to focus tonight on the first couple verses of it.  We'll probably look at the rest of it next week.\n\n\n***So let's pray and I'll give you three points about it.***\n\nThis chapter starts with God coming to Abraham and saying *Abram, fear not.*\n\nSo, point number 1 -\n\n# 1. The Problem:\n\nAnd the problem was fear.  Fear.\n\nApparently, Abram was afraid.  \n\nNow, humanly speaking, he had good reason to be scared.  Let me give you two of them:\n\n## A. Fear of powerful enemies\n\nRemember what happened in the last chapter?  He took on Chadalaemer - the warrior king.  He, one guy with his small band of soldiers, took on his era's equivalent of Alexander the Great or Napaleon and won.  Chadalaemer must have been steamed and Abraham probably feared that this super powerful guy would come back with a vengeance - wouldn't you?  \n\nBut I think there was a second thing that Abram was fearing at this point in his life and it was:\n\n\n## B. Fear of empty promises.\n\nHold your finger here and turn back to chapter 12.  God tells Abram to get out of Ur and follow Him and Abram does.  He doesn't do it right away. But he does.\n\nThen, in verse 2 look what God says to Abram:\n\n> *\"And I will make of thee a great nation, and I will bless thee, and make thy name great; and thou shalt be a blessing:\"* (2)\n\nSo, God had promised Abram that He would make his name great and that He would bless him and make him into a great nation.\n\nThen look down at verse 7:\n\n> *\"And the LORD appeared unto Abram, and said, Unto thy seed will I give this land: and there builded he an altar unto the LORD, who appeared unto him.\"* (7)\n\nHere God reiterates this promise but adds that God would give his seed the land.\n\nAlright, fast forward back to chapter 15.  It's been something like 15-25 years.  Abraham is an old man, Sarah is an old woman and they still have no child.\n\nSo God had promised land to Abram's seed - but at this point Abram is too old and he still doesn't have any seed.  Every promise of God at this point seems like a sham.\n\nAnd Abram is alone in the desert on a starry night mulling all of this over.  Of course he was afraid.  He probably was doubting.\n\n---\n\nSo that's the problem.  Let's look at point 2 -\n\n\n# 2. The answer:\n\nLook at verse 1 again:\n\n> *\"After these things the word of the LORD came unto Abram in a vision, saying, Fear not, \"*\n\nDo you know what I love about this?  God came to Abram.  God looked down from heaven and saw that His child was in a time of need, God looked into the head of Abram and saw what was there and God said \"This man needs some help\" and God came to Him.\n\nGod does that sometimes.  We ought to rush to Him, but sometimes He beats us there.\n\nNotice what God says - these words are powerful:\n\n> *\"Fear not, Abram: I am thy shield, and thy exceeding great reward.\"*\n\nHe says Fear not!  \n\nWhy Abram?  Why fear not?  What possible reason do you have to not fear?\n\n> *Fear not, Abram, I.*\n\nHere is the amazing thing.  Fear is the problem in this passage.  Do you know what the answer is?  It's God.  Just God.  The person and character of God.\n\nWhy shouldn't you fear?  Why is fear not repeated 63 times in the scripture?  God.  It's because of WHO He is we can get through trials.  It's Him.\n\nSpecifically, though, God wanted Abram to know two things about Himself. First, \n\n## A. God was Abram's Shield.\n\nDo you know what God was saying there?  You could sum it up in three simple words \"I'm protecting you.\"  I'm watching out for you.  I'm your bodyguard.  I've got your back.\n\nWhen you walk with God you are walking around with the greatest insurance plan you could ever have.  You may be in good hands with All-state but that's nothing like the protection of being in God's hands.  You can walk into war zones in God's will and be totally untouchable.  You can get thrown into a fiery furnace so hot the people who throw you in die of heat and come out unscathed if you are under God's protection.  You can have the armies of this world descend upon you and be totally calm because the armies of God are descending on them and it's no contest.\n\nWe can say like Paul in Romans 8:\n\n> *\"For I am persuaded, that neither death, nor life, nor angels, nor principalities, nor powers, nor things present, nor things to come, Nor height, nor depth, nor any other creature, shall be able to separate us from the love of God, which is in Christ Jesus our Lord.\"*\n\nBecause you are in God's hands.  He is your shield.\n\nThe second thing God wanted Abram to know about Himself was...\n\n## B. God was Abram's Exceeding Great Reward.\n\nNow, Abram was thinking about the promise of God - the land, the children, the nation.  All of that.  But God said to Abram - no \"I am your reward.\"\n\nI love how a preacher named F.B. Meyer from the 1800s put it:\n\n> \"Come now, my child, and think; even if thou wert never to have one foot of soil, and thy tent were to stand silent, amid the merry laughter of childish voices all around -- yet thou wouldest not have left thy land in vain, for thou hast Me. Am not I enough? I fill heaven and earth; cannot I fill one lonely soul? Am not I 'thy exceeding great reward'; - F.B. Meyer\n\nIn other words - listen - even if God gives you nothing else but Himself - He's given you more than anything you could ever even ask for.\n\nMost of the time, God blesses His followers.  Proverbs says *\"I have not seen the righteous forsaken nor his seed begging bread.\"*  The book of Luke says *\"Give, and it shall be given unto you; good measure, pressed down, and shaken together, and running over, shall men give into your bosom.\"*  Jesus promised his disciples *\"And every one that hath forsaken houses, or brethren, or sisters, or father, or mother, or wife, or children, or lands, for my name's sake, shall receive an hundredfold, and shall inherit everlasting life.\"*\n\nSometimes God's will is for us to go through times of poverty and hardship, but most of the time God blesses those who follow Him.  But listen, if you get nothing.  No financial blessing, nor family blessing.  Nothing besides a walk with God - you've still got the deal of a lifetime.\n\nSo God was reminding Abram of this.  Abram had God.  He had a relationship with God. God was looking out for Him and taking care of Him.  Don't fear, I'm here.\n\n# 3. The promise:\n\nSo Abram listens, and while He's talking to God, He addresses the elephant in the room. He asks \"What about the promise of a child?  You promised me that, and I have no son, all I have is a steward, is He supposed to be my heir?\"\n\nLook at God's answer (in verse 4-6):\n\n> *\"[Gen 15:4-6 KJV] 4 And, behold, the word of the LORD [came] unto him, saying, This shall not be thine heir; but he that shall come forth out of thine own bowels shall be thine heir. 5 And he brought him forth abroad, and said, Look now toward heaven, and tell the stars, if thou be able to number them: and he said unto him, So shall thy seed be. 6 And he believed in the LORD; and he counted it to him for righteousness.\"*\n\nGod said \"No, no, no Abram.  You are getting ahead of yourself. I'm going to give you more natural offspring than you could possibly count.  Look at all of those stars - you'll have more offspring than that.\"\n\nWe know the rest of the story.  God did.  Abram was old - way too old. But God worked a miracle.  \n\nThe lesson from that is this:\n\n> We often mistake God's delays as denials.\n\nSometimes we think God is saying \"No\" when God is just saying \"not yet.\"  \"Wait a little while.\"  Trust me, I know what I'm doing.\n\nAs a parent, sometimes my kids want to know every detail.  When are we leaving, what way are we going, what stops are we making, who are we going to see.  Amanda has a saying, she says \"Ride the bus.\"  That means \"Just trust me, I've got a plan, just go along.\"\n\nSometimes God says to us \"Just ride the bus, the ride might take a little longer than you think it should, but I know exactly what I'm doing.\"\n\nAnd church - never forget this - God knows exactly what He's doing.  His plan for you is perfect.  You might not like every stop on the itinerary. You might have to deal with the cancer stop - didn't plan on that.  Maybe you stop at a place called divorce - didn't want to go there.  Maybe you have to go through poverty - or lonliness - or whatever and you say \"God, are you shure you know where you are going?\" It might not be what you expected.  But ride the bus.  Trust God.  He wants what is best for you and He has a plan for you.\n\nThe last point this evening is:\n\n# 4. The response:\n\nLook at verse 6:\n\n> *\"And he believed in the LORD; and he counted it to him for righteousness.\"* (6)\n\n\n","sermon_mp3":[{"id":"attZDx1zAP0FuP0tD","url":"https://dl.airtable.com/wzBkLGDSSSDmoOPBUcCw_2016%200710%20sunpm.mp3","filename":"2016 0710 sunpm.mp3","size":28396563,"type":"audio/mp3"}],"series":["receF5EJ1Mtrjz1Ne"],"service":"Sunday PM","date":"2016-07-10","bible_text":"Genesis 15","speaker":["reczJXlkg63judAaw"],"published":true,"speaker_name":["Ryan Hayden"],"speaker_bio":["Ryan Hayden has served as the pastor at Bible Baptist since 2011.  He loves simple, direct, Bible based preaching.  He blogs at pastorryanhayden.com and is the host of the podcast \"The Foolishness of Preaching\" as well as a daily devotional radio show."],"speaker_role":["Pastor"],"speaker_thumbnail":[{"id":"attiOBQEp50XuGPhA","url":"https://dl.airtable.com/LJGYxDMRxuJNDVwB8peA_Photo%20on%205-10-16%20at%206.26%20PM.jpg","filename":"Photo on 5-10-16 at 6.26 PM.jpg","type":"image/jpeg","size":52652,"width":375,"height":375,"smallThumbUrl":"https://dl.airtable.com/BvvqdOhNTveYIc1lb8fP_small_Photo%20on%205-10-16%20at%206.26%20PM.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/alezlQj3Qdm6UQIO2DQR_large_Photo%20on%205-10-16%20at%206.26%20PM.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"series_title":["Genesis"],"series_description":["On Sunday evenings we are studying the book of Genesis.  Starting from creation through the story of God calling out his people - Israel."],"series_featured_image":[{"id":"attVp8DTzQ7rOLmKn","url":"https://dl.airtable.com/imwruW8T8KjARILAP0jv_Genesis.jpg","filename":"Genesis.jpg","type":"image/jpeg","size":693801,"width":1920,"height":1080,"smallThumbUrl":"https://dl.airtable.com/6ZVwSCkqRHKU64d67oFv_small_Genesis.jpg","smallThumbWidth":64,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/d57JC1Z7Q2FESJPU6XYQ_large_Genesis.jpg","largeThumbWidth":256,"largeThumbHeight":144}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Prodigals: The Anti-Prodigal","sermon_mp3":[{"id":"attJ9lGyEJNUcWpUM","url":"https://dl.airtable.com/EHBB3lfARLWclZ1MoeWn_2016%200619%20sunpm.mp3","filename":"2016 0619 sunpm.mp3","size":33513638,"type":"audio/mp3"}],"series":["recCSWkhDcssIH71H"],"service":"Sunday PM","date":"2016-06-19","bible_text":"Luke 15:25-32","speaker":["reczJXlkg63judAaw"],"published":true,"speaker_name":["Ryan Hayden"],"speaker_bio":["Ryan Hayden has served as the pastor at Bible Baptist since 2011.  He loves simple, direct, Bible based preaching.  He blogs at pastorryanhayden.com and is the host of the podcast \"The Foolishness of Preaching\" as well as a daily devotional radio show."],"speaker_role":["Pastor"],"speaker_thumbnail":[{"id":"attiOBQEp50XuGPhA","url":"https://dl.airtable.com/LJGYxDMRxuJNDVwB8peA_Photo%20on%205-10-16%20at%206.26%20PM.jpg","filename":"Photo on 5-10-16 at 6.26 PM.jpg","type":"image/jpeg","size":52652,"width":375,"height":375,"smallThumbUrl":"https://dl.airtable.com/BvvqdOhNTveYIc1lb8fP_small_Photo%20on%205-10-16%20at%206.26%20PM.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/alezlQj3Qdm6UQIO2DQR_large_Photo%20on%205-10-16%20at%206.26%20PM.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"series_title":["Prodigals"],"series_description":["The story of the “Prodigal Son” is an amazing parable that reveals a lot about God’s grace, our depravity and the utter failure of religion.  In this mini-series Pastor Hayden is taking a deep look at all of the prodigals in Luke 15 - not just the son."],"series_featured_image":[{"id":"attxzjiqtWZv0n4yD","url":"https://dl.airtable.com/vMUrP6EQX2g5f1IL2tQ1_Screen%20Shot%202016-06-14%20at%203.56.34%20PM.png","filename":"Screen Shot 2016-06-14 at 3.56.34 PM.png","type":"image/png","size":160371,"width":1920,"height":1080,"smallThumbUrl":"https://dl.airtable.com/FQ6e4NbURyK4veM9pRDd_small_Screen%20Shot%202016-06-14%20at%203.56.34%20PM.png","smallThumbWidth":64,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/u0HlyRt4QiixYreOShLX_large_Screen%20Shot%202016-06-14%20at%203.56.34%20PM.png","largeThumbWidth":512,"largeThumbHeight":512}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Prodigals:The Son","sermon_mp3":[{"id":"attAETEob7HAX0SSQ","url":"https://dl.airtable.com/jWFWUfeTouZKPvCne2eC_2016%200612%20am.mp3","filename":"2016 0612 am.mp3","size":18354176,"type":"audio/mp3"}],"series":["recCSWkhDcssIH71H"],"service":"Sunday AM","date":"2016-06-12","bible_text":"Luke 15:11-32","speaker":["reczJXlkg63judAaw"],"updated_at":"2016-02-17T14:31:07.000Z","published":true,"speaker_name":["Ryan Hayden"],"speaker_bio":["Ryan Hayden has served as the pastor at Bible Baptist since 2011.  He loves simple, direct, Bible based preaching.  He blogs at pastorryanhayden.com and is the host of the podcast \"The Foolishness of Preaching\" as well as a daily devotional radio show."],"speaker_role":["Pastor"],"speaker_thumbnail":[{"id":"attiOBQEp50XuGPhA","url":"https://dl.airtable.com/LJGYxDMRxuJNDVwB8peA_Photo%20on%205-10-16%20at%206.26%20PM.jpg","filename":"Photo on 5-10-16 at 6.26 PM.jpg","type":"image/jpeg","size":52652,"width":375,"height":375,"smallThumbUrl":"https://dl.airtable.com/BvvqdOhNTveYIc1lb8fP_small_Photo%20on%205-10-16%20at%206.26%20PM.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/alezlQj3Qdm6UQIO2DQR_large_Photo%20on%205-10-16%20at%206.26%20PM.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"series_title":["Prodigals"],"series_description":["The story of the “Prodigal Son” is an amazing parable that reveals a lot about God’s grace, our depravity and the utter failure of religion.  In this mini-series Pastor Hayden is taking a deep look at all of the prodigals in Luke 15 - not just the son."],"series_featured_image":[{"id":"attxzjiqtWZv0n4yD","url":"https://dl.airtable.com/vMUrP6EQX2g5f1IL2tQ1_Screen%20Shot%202016-06-14%20at%203.56.34%20PM.png","filename":"Screen Shot 2016-06-14 at 3.56.34 PM.png","type":"image/png","size":160371,"width":1920,"height":1080,"smallThumbUrl":"https://dl.airtable.com/FQ6e4NbURyK4veM9pRDd_small_Screen%20Shot%202016-06-14%20at%203.56.34%20PM.png","smallThumbWidth":64,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/u0HlyRt4QiixYreOShLX_large_Screen%20Shot%202016-06-14%20at%203.56.34%20PM.png","largeThumbWidth":512,"largeThumbHeight":512}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Prodigals:The Father","sermon_mp3":[{"id":"attutxzVV64xI0tiu","url":"https://dl.airtable.com/OUoDxtG2ThkzXqDbo5wQ_2016%200612%20sunpm.mp3","filename":"2016 0612 sunpm.mp3","size":17711104,"type":"audio/mp3"}],"series":["recCSWkhDcssIH71H"],"service":"Sunday PM","date":"2016-06-12","bible_text":"Luke 15:11-32","speaker":["reczJXlkg63judAaw"],"updated_at":"2016-06-18T14:31:00.000Z","published":true,"speaker_name":["Ryan Hayden"],"speaker_bio":["Ryan Hayden has served as the pastor at Bible Baptist since 2011.  He loves simple, direct, Bible based preaching.  He blogs at pastorryanhayden.com and is the host of the podcast \"The Foolishness of Preaching\" as well as a daily devotional radio show."],"speaker_role":["Pastor"],"speaker_thumbnail":[{"id":"attiOBQEp50XuGPhA","url":"https://dl.airtable.com/LJGYxDMRxuJNDVwB8peA_Photo%20on%205-10-16%20at%206.26%20PM.jpg","filename":"Photo on 5-10-16 at 6.26 PM.jpg","type":"image/jpeg","size":52652,"width":375,"height":375,"smallThumbUrl":"https://dl.airtable.com/BvvqdOhNTveYIc1lb8fP_small_Photo%20on%205-10-16%20at%206.26%20PM.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/alezlQj3Qdm6UQIO2DQR_large_Photo%20on%205-10-16%20at%206.26%20PM.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"series_title":["Prodigals"],"series_description":["The story of the “Prodigal Son” is an amazing parable that reveals a lot about God’s grace, our depravity and the utter failure of religion.  In this mini-series Pastor Hayden is taking a deep look at all of the prodigals in Luke 15 - not just the son."],"series_featured_image":[{"id":"attxzjiqtWZv0n4yD","url":"https://dl.airtable.com/vMUrP6EQX2g5f1IL2tQ1_Screen%20Shot%202016-06-14%20at%203.56.34%20PM.png","filename":"Screen Shot 2016-06-14 at 3.56.34 PM.png","type":"image/png","size":160371,"width":1920,"height":1080,"smallThumbUrl":"https://dl.airtable.com/FQ6e4NbURyK4veM9pRDd_small_Screen%20Shot%202016-06-14%20at%203.56.34%20PM.png","smallThumbWidth":64,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/u0HlyRt4QiixYreOShLX_large_Screen%20Shot%202016-06-14%20at%203.56.34%20PM.png","largeThumbWidth":512,"largeThumbHeight":512}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"God Has a Plan","sermon_mp3":[{"id":"attaJHg62Z0u7Y3nn","url":"https://dl.airtable.com/JQFUBtm3RB2nsEt7HAkb_2016%200605.mp3","filename":"2016 0605.mp3","size":39703195,"type":"audio/mp3"}],"series":["rec3tyk9G6hMIu9lq"],"service":"Sunday AM","date":"2016-06-05","bible_text":"Daniel 5","speaker":["recoL3HsFwKj4MSF9"],"published":true,"speaker_name":["John Rinker"],"speaker_bio":["John Rinker is a member of Bible Baptist.  God has used him in the past as both a pastor and missionary.  Currently, he serves many churches with pulpit supply."],"speaker_role":["Lay Preacher"],"series_title":["No Series"],"series_description":["This is a catch all for sermons who have no series."],"series_featured_image":[{"id":"attJtQCAIqYQmkVm3","url":"https://dl.airtable.com/D6kZAUIGSPvLkMQtnfPN_4.jpg","filename":"4.jpg","type":"image/jpeg","size":1653955,"width":1920,"height":1080,"smallThumbUrl":"https://dl.airtable.com/wN0hXpWORvOzRSIE2Vsk_small_4.jpg","smallThumbWidth":64,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/1qk4es1SUyAGpd6vN1Ax_large_4.jpg","largeThumbWidth":256,"largeThumbHeight":144}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Back to Basics","sermon_mp3":[{"id":"attzHxkueBFymWIgJ","url":"https://dl.airtable.com/gLbx64cmThqhb0w7R4n0_2016%200605%20pm.mp3","filename":"2016 0605 pm.mp3","size":26576351,"type":"audio/mp3"}],"series":["receF5EJ1Mtrjz1Ne"],"service":"Sunday PM","date":"2016-06-05","bible_text":"Genesis 13","speaker":["recwKzAUSs0YXfR3w"],"published":true,"speaker_name":["Adam McCaslin"],"speaker_bio":["Adam McCaslin serves as the youth pastor at Bible Baptist.  A native of Dalton, GA and a graduate of the Crown College of the Bible, Adam is passionate about missions and evangelism."],"speaker_role":["Church Staff"],"speaker_thumbnail":[{"id":"attorFMyL83F5mcLC","url":"https://dl.airtable.com/PfnPUcZTLO3tRNUbst5A_Screen%20Shot%202016-05-10%20at%206.28.31%20PM.png","filename":"Screen Shot 2016-05-10 at 6.28.31 PM.png","type":"image/png","size":150699,"width":271,"height":271,"smallThumbUrl":"https://dl.airtable.com/a73vhwq7TaaSIkgNIV0E_small_Screen%20Shot%202016-05-10%20at%206.28.31%20PM.png","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/24V7xCQ0SA8PRadZTjMw_large_Screen%20Shot%202016-05-10%20at%206.28.31%20PM.png","largeThumbWidth":256,"largeThumbHeight":256}],"series_title":["Genesis"],"series_description":["On Sunday evenings we are studying the book of Genesis.  Starting from creation through the story of God calling out his people - Israel."],"series_featured_image":[{"id":"attVp8DTzQ7rOLmKn","url":"https://dl.airtable.com/imwruW8T8KjARILAP0jv_Genesis.jpg","filename":"Genesis.jpg","type":"image/jpeg","size":693801,"width":1920,"height":1080,"smallThumbUrl":"https://dl.airtable.com/6ZVwSCkqRHKU64d67oFv_small_Genesis.jpg","smallThumbWidth":64,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/d57JC1Z7Q2FESJPU6XYQ_large_Genesis.jpg","largeThumbWidth":256,"largeThumbHeight":144}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Full Assurance","sermon_mp3":[{"id":"attLcgNl0NFIqj5zz","url":"https://dl.airtable.com/6YqlQRRLT6GVnjxl70qX_2016%200529%20sun%20am.mp3","filename":"2016 0529 sun am.mp3","size":37876714,"type":"audio/mp3"}],"series":["rec3tyk9G6hMIu9lq"],"service":"Sunday AM","date":"2016-05-29","bible_text":"Various","speaker":["recoL3HsFwKj4MSF9"],"published":true,"speaker_name":["John Rinker"],"speaker_bio":["John Rinker is a member of Bible Baptist.  God has used him in the past as both a pastor and missionary.  Currently, he serves many churches with pulpit supply."],"speaker_role":["Lay Preacher"],"series_title":["No Series"],"series_description":["This is a catch all for sermons who have no series."],"series_featured_image":[{"id":"attJtQCAIqYQmkVm3","url":"https://dl.airtable.com/D6kZAUIGSPvLkMQtnfPN_4.jpg","filename":"4.jpg","type":"image/jpeg","size":1653955,"width":1920,"height":1080,"smallThumbUrl":"https://dl.airtable.com/wN0hXpWORvOzRSIE2Vsk_small_4.jpg","smallThumbWidth":64,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/1qk4es1SUyAGpd6vN1Ax_large_4.jpg","largeThumbWidth":256,"largeThumbHeight":144}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"A Believer's Journey","sermon_mp3":[{"id":"attDDiajgh2YaTjqB","url":"https://dl.airtable.com/kwKbPnZBS12YgzUgpj3d_2016%200529.mp3","filename":"2016 0529.mp3","size":29261739,"type":"audio/mp3"}],"series":["receF5EJ1Mtrjz1Ne"],"service":"Sunday PM","date":"2016-05-29","bible_text":"Genesis 12","speaker":["recwKzAUSs0YXfR3w"],"published":true,"speaker_name":["Adam McCaslin"],"speaker_bio":["Adam McCaslin serves as the youth pastor at Bible Baptist.  A native of Dalton, GA and a graduate of the Crown College of the Bible, Adam is passionate about missions and evangelism."],"speaker_role":["Church Staff"],"speaker_thumbnail":[{"id":"attorFMyL83F5mcLC","url":"https://dl.airtable.com/PfnPUcZTLO3tRNUbst5A_Screen%20Shot%202016-05-10%20at%206.28.31%20PM.png","filename":"Screen Shot 2016-05-10 at 6.28.31 PM.png","type":"image/png","size":150699,"width":271,"height":271,"smallThumbUrl":"https://dl.airtable.com/a73vhwq7TaaSIkgNIV0E_small_Screen%20Shot%202016-05-10%20at%206.28.31%20PM.png","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/24V7xCQ0SA8PRadZTjMw_large_Screen%20Shot%202016-05-10%20at%206.28.31%20PM.png","largeThumbWidth":256,"largeThumbHeight":256}],"series_title":["Genesis"],"series_description":["On Sunday evenings we are studying the book of Genesis.  Starting from creation through the story of God calling out his people - Israel."],"series_featured_image":[{"id":"attVp8DTzQ7rOLmKn","url":"https://dl.airtable.com/imwruW8T8KjARILAP0jv_Genesis.jpg","filename":"Genesis.jpg","type":"image/jpeg","size":693801,"width":1920,"height":1080,"smallThumbUrl":"https://dl.airtable.com/6ZVwSCkqRHKU64d67oFv_small_Genesis.jpg","smallThumbWidth":64,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/d57JC1Z7Q2FESJPU6XYQ_large_Genesis.jpg","largeThumbWidth":256,"largeThumbHeight":144}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"When They Throw Rocks","body_content":"# Introduction: Courage\n\nI want to start this morning by reading you one of my favorite speeches from any movie. You let me know at the end if you've figured out what movie this comes from?\n\n```\nCourage! What makes a King out of a slave?\nCourage! What makes the flag on the mast to wave?\nCourage! What makes the elephant charge his tusk, in the misty mist or the dusky dusk?\nWhat makes the muskrat guard his musk?\nCourage! What makes the sphinx the seventh wonder?\nCourage! What makes the dawn come up like thunder?\nCourage! What makes the Hottentot so hot? What puts the \"ape\" in apricot?\nWhat have they got that I ain't got?\nCourage!\n```\n\nWhat movie did it come from?  That's right, the Wizard of Oz.\n\nI read you that because today's message is a message about courage.\n\nWe live in a trying time.  The world is turning sharply against the message of the gospel.  They never really liked it - they always have held Bible believing Christians in scorn - but they are very, very vocal about it now and growing more so all the time.  They are beginning to, more and more, push anti-biblical and frankly anti-common sense ideas.  This whole transgender bathrooms thing is a good example. There was some news this week about adult strollers.  Yes - you heard that right.  Not for handicapped people.  Just for adults who want to be kids again.  There are people out there who \"self-identify\" as a six year old, even though they are fully grown.  Trans-toddlers I guess you would call them.  It's absurd.\n\nBut it's also accepted and more and more it's going to be mandated.  So what is a Christian to do?\n\nI think we ought to speak out boldly against it.  We ought to be loving.  We ought to remember that these folks that are pushing this stuff are souls for whom Christ died and they are just manifesting different symptoms of the same sin we all struggle with.  But we have to speak out for truth.\n\nBut here is the thing you have to understand: When you speak out for truth when it's not popular - their will be consequences.  You can't have your cake and eat it too.  If you take an unpopular stand - it you won't be popular.  If you tell the emperor that his new clothes don't exist, you might end up in prison.  Some people will believe you - some people will despise you.\n\nIf there is one message, one truth, that has always been unpopular, that has always made people angry - it's the gospel of Jesus Christ.  \n\nListen, if you boldly share the gospel of Jesus Christ - there will be consequences. But there will also be miracles.\n\nIf we are going to share the gospel as we ought to, it's going to require courage.  \n\nOur story this morning is a great example of that.\n\n---\n\nTake your Bibles and turn with me to Acts 14. Acts 14.  We are going to look at almost all of the passage today.  This is the last real story in what was Paul's first missionary journey - and it's an interesting one.duc\n\nLet's take a look:\n\nWe are going to read 7 chapter 14 verses 1-20.\n\n> *\"And it came to pass in Iconium, that they went both together into the synagogue of the Jews, and so spake, that a great multitude both of the Jews and also of the Greeks believed. But the unbelieving Jews stirred up the Gentiles, and made their minds evil affected against the brethren. Long time therefore abode they speaking boldly in the Lord, which gave testimony unto the word of his grace, and granted signs and wonders to be done by their hands. But the multitude of the city was divided:and part held with the Jews, and part with the apostles. And when there was an assault made both of the Gentiles, and also of the Jews with their rulers, to use them despitefully, and to stone them, They were ware of it, and fled unto Lystra and Derbe, cities of Lycaonia, and unto the region that lieth round about: And there they preached the gospel\"*\n\n> *\"And there sat a certain man at Lystra, impotent in his feet, being a cripple from his mother's womb, who never had walked: The same heard Paul speak:who stedfastly beholding him, and perceiving that he had faith to be healed, Said with a loud voice, Stand upright on thy feet. And he leaped and walked. And when the people saw what Paul had done, they lifted up their voices, saying in the speech of Lycaonia, The gods are come down to us in the likeness of men. And they called Barnabas, Jupiter; and Paul, Mercurius, because he was the chief speaker. Then the priest of Jupiter, which was before their city, brought oxen and garlands unto the gates, and would have done sacrifice with the people. Which when the apostles, Barnabas and Paul, heard of, they rent their clothes, and ran in among the people, crying out, And saying, Sirs, why do ye these things? We also are men of like passions with you, and preach unto you that ye should turn from these vanities unto the living God, which made heaven, and earth, and the sea, and all things that are therein: Who in times past suffered all nations to walk in their own ways. Nevertheless he left not himself without witness, in that he did good, and gave us rain from heaven, and fruitful seasons, filling our hearts with food and gladness. And with these sayings scarce restrained they the people, that they had not done sacrifice unto them\"*\n\n> *\"And there came thither certain Jews from Antioch and Iconium, who persuaded the people, and, having stoned Paul, drew him out of the city, supposing he had been dead. Howbeit, as the disciples stood round about him, he rose up, and came into the city:and the next day he departed with Barnabas to Derbe\"*\n\nThe title of the message is \"When they throw rocks.\"  \n\nI listen to a political commentator named Ben Shapiro a lot.  I first heard about Ben Shapiro because of some things that kept happening when he visited college campuses.  He'd get invited to speak by some college group and then people would protest.  They would shout at anyone who tried to get in.  They would go into his meeting and yell.  They would pull the fire alarm.  People that actually want to go to the meetings have to find an alternate entrance because, often, protesters will block the door.\n\nNow, this guy is a pretty level headed guy.  He's not a skinhead.  He's not a Nazi.  He's not a racist.  He just says common sense stuff and some of it isn't politically correct and so his detractors will do almost anything to shut him up.\n\nBut they've never thrown rocks.  They've never tried to kill him.\n\nIn the story this morning - Paul deals with all kinds of opposition - culminating in him being stoned.  A mob literally through rocks at him until they thought he was dead.\n\nLet's see why.  I'm breaking down my message this morning into three parts:\n* What the haters do\n* What the courageous do\n* What God does\n\n**Let's pray and then get into this story:**\n\nThis passage takes place in three cities.  First Paul travels to Iconium\n\nHe does in Iconium exactly what he did last week in Antioch of Pisidia.  He goes into the synagogue and he preaches the gospel.  He tells people about Jesus and how Jesus died to save them.\n\nAnd He has the same results.  A great multitude believe.  That's awesome.  Praise the Lord.  That's a great multitude who will be in heaven.  Who will have Christian homes and raise Christian kids.  That's fantastic.\n\nBut not everyone liked it.  In fact, some people hated it.  Look at verse 2:\n\n> *\"But the unbelieving Jews stirred up the Gentiles, and made their minds evil affected against the brethren.\"*\n\nSo, let's look at our first point...\n\n# 1. What the haters do\n\nand the first thing they do is:\n\n## They reject the truth.\n\nNotice this - some people believed - some people resisted.  To some people it was the greatest news they had ever heard but to others it was fighting words.\n\nThere are going to be people who, when they hear the gospel, get angry.  Get mad.  It's the best news in the whole world - but most who have heard it rejected it.\n\nThat's what many of these people in Iconium did, but they went beyond just rejecting the truth, they...\n\n## They slandered the truthful\n\nThey did something about it.  \n\nThey went around spreading lies about Paul and Barnabas.\n\nThis has always been one of the Devil's favorite tactics.  You know, in the early church the Romans believed all kinds of crazy things about the Christians, including that the Lord's supper was a human sacrifice.  THey thought they were political revolutionaries.  Crazy and unbelievable stuff.  But people said it about them and some people believed them.\n\nSlander.\n\nDo you know if you take a bold stand for God - some people won't like it?  Some people might even say some untrue things about you. They might even say you've joined a cult.  They might call you names.  They might even run around with their fingers in their ears and shout nanna-nanna-boo-boo.\n\nSeveral years ago there was a push to kick Chick-fil-a off of the Eastern Illinois campus because, in their words \"it didn't fit their values.\"  I wrote an article in the paper and I said basically - that if you go down this route - where does it stop?  \n\nWould you believe that a few weeks later, there was an article in the paper about me?  Someone who I've never met called me all kinds of nice names like false prophet and bigot.\n\nLook - if you are going to preach the gospel and take a stand for the truth not everyone is going to like it.  Some people will hate it.\n\nThat's part of it.\n\nBut in Paul's case, it went beyond slander.  They moved from slander to:\n\n## Threats\n\nLook at verse:\n\n> *\" And when there was an assault made both of the Gentiles, and also of the Jews with their rulers, to use them despitefully, and to stone them, They were ware of it, and fled unto Lystra and Derbe\"*\n\nThe slander didn't work well enough.  People were still believing the gospel and getting saved.  So the enemies of the gospel ratcheted it up a notch and started planning to stone Paul.\n\nNow notice - it mentions the rulers here.  There were some powerful people in on this.  And they are making plans.  They are conspiring.\n\nChurch - let me tell you that if you stand for the truth - no matter how lovingly - there may be people who conspire against you.  You may be passed up for a job promotion.  You may be ruled out in public service.  It may be worse.\n\nSo Paul so how serious this was and he decided it was better for him and Barnabas to leave.  No shame in that.  So they went on to Derbe and Lystra.  These were nearby cities, but outside of the governmental reach of Iconium.  It would be like going from Mattoon to Terre Haute.  \n\nAnd what did they do in Derbe in Lystra - the same thing they did in Iconium, the same thing they did in Antioch of Pisidia - they preached Jesus.\n\n---\n\nNow, there is an interesting story here.  I'm not going to get into it very much. But when Barnabas and Paul were preaching in Lystra, they healed someone and due to some local tradition, they were mistaken as gods.  They even had the local priest come out and try to offer bulls to them.\n\nSo immediately their message changed to \"we aren't God's but let me tell you about God and His son Jesus\"  \n\n---\n\nThis brings me to the fourth thing that the haters sometimes do.  Sometimes...\n\n##### They hurt\n\nIn Lystra, some of the people from Iconium caught up with them and started making trouble and telling lies there and this time - they did stone Paul.  They literally got a mob to pick up rocks and throw them at Paul until he was dead (or at least they thought.)  Then, because they didn't want to get in trouble, they dragged his dead body outside of town.\n\nNow, Paul wasn't dead. We'll get to that in a second.\n\nBut here is the point - sometimes the haters do hurt you.  Sometimes it goes beyond threats. \n\nWe support a missionary named John Leonard.  Brother Leonard was starting a church in one of the worst slums in Brazil.  God was blessing. People were getting saved.  Lots of people.\n\nWhen those people got saved, they stopped buying drugs from the local cartel.  They stopped putting money in their pockets.  So after enough of this went on the cartel put a hit on John Leonard's life and one day, outside of their church, a hit man walked up to John Leonard and shot him multiple times and left him for dead.\n\nSometimes, if you serve Christ, people will hurt you.  Real violence can happen.  We are fortunate that it doesn't happen here in AMerica very often but it could.  \n\nSo what do the haters do?  Everything they can to hurt the message of Jesus Christ.\n\nBut let's move on and look at...\n\n# 2. What the courageous do\n\nWhat did Paul and Barnabas do in this harsh opposition? I want you to see three things:\n\nFirst,\n\n## They keep speaking the truth in the face of lies.\n\nI love verse 3, Paul and Barnabas are getting lied about.  They are getting slandered.  Threats are starting to come in. And what is their response?  Look at verse 3:\n\n> *\"Long time therefore abode they speaking boldly in the Lord, which gave testimony unto the word of his grace, and granted signs and wonders to be done by their hands\"**\n\nThey didn't run from trouble - they tried to teach their way out of trouble.  They knew they had the truth so they just kept preaching the truth and telling people what God had said.\n\nThe old preacher John Wesley used to say \n\n> \"Always look a crowd in the face\"\n\nYou can do that when you have the truth.  You aren't afraid of scrutiny - you invite it.  You aren't afraid of questions - let them come - you'll answer them.\n\nDo you know what I want to do when people are saying nasty things about me?  I want to get out of there.  I want to run.  But that's not what Paul did.  He kept on preaching.\n\nI think a second thing we see that he did and that courageous people do is....\n\n## They keep trusting the God they can't see in the face of the enemy they can see.\n\nThis is amazing faith.  You have an angry crowd of people around you and they are threatening you and they are lying about you and they are trying to shut you up.  That's scary.\n\nBut Paul and Barnabas just trusted God.  They trusted God's truth to do it's work.  They trusted God's power to back them up.  They trusted God's calling on their life.  They trusted God.\n\nI was listening to a lecture this week about Martin Luther.  We don't agree with everything Luther did or said, but their is no doubt he loved God and was used to open the doors of true salvation for many, many people.\n\nWhen Luther was on trial before the Pope's court - he could have lost his life.  He could have been mercilessly tortured.  Many people before him had.  He was before the most powerful forces on this earth.  But do you know what he said, he said\n\n> Here I stand, I can do no other. So help me God.\n\nIt takes faith to trust God when you are going through the valley of the shadow of death.  It takes faith to trust God when the enemies are hurling their darts and sharpening their teeth.\n\nBut it's not a foolish faith - because no matter how powerful the enemies may seem they aren't more powerful than God.\n\nLet me show you one more thing that the courageous do:\n\n# They keep going in the face of more.\n\nWhen Paul and Barnabas hit the wall in Iconium, they went to Lystra for more of the same.  What's amazing is what we see at the end of the chapter.  Paul got stoned.  Not Bob Marley stoned.  Literally bludgeoned to the point where everyone thought he was dead.\n\nAnd what does he do?  Look at verses 19-21.  These are some of the most amazing verses in the Bible:\n\n> *\"And there came thither certain Jews from Antioch and Iconium, who persuaded the people, and, having stoned Paul, drew him out of the city, supposing he had been dead. Howbeit, as the disciples stood round about him, he rose up, and came into the city:and the next day he departed with Barnabas to Derbe. And when they had preached the gospel to that city, and had taught many, they returned again to Lystra, and to Iconium, and Antioch\"*\n\nPaul gets up when everyone else thinks he's dead and he go's right back into the city where he was stoned.  Then he goes right back to preaching the gospel.  Eventually, he even visits these cities again where so many people hated him.\n\nHe kept going.\n\nHold your finger here and turn with me to Acts 20 for a second.  Acts 20.  Look at verse 24.  This is Paul talking about all that he's gone through for the gospel and look what he says in verse 24:\n\n> *\"But none of these things move me, neither count I my life dear unto myself, so that I might finish my course with joy, and the ministry, which I have received of the Lord Jesus, to testify the gospel of the grace of God\"*\n\nThat's courage.\n\nI told you about John Leonard getting shot.  He's paralyzed from the waste down.  Do you know where he is today?  He's in a slum in Brazil preaching to people from a wheelchair.\n\nListen folks, keep serving God.  Keep standing for the truth.  If it's hard keep going.  If they throw rocks keep going.  Don't let the darkness put the light out.  Keep it shining bright for Jesus.\n\nThere is one more thing I want to show you before we close and that is:\n\n# 3. What God does\n\nWe've seen what the haters did and what the courageous did.  Let's see what God did here.  Let me quickly go through this:\n\nFirst,\n\n## God empowers\n\nGod empowered Paul and Barnabas to preach in the middle of opposition. He empowered them to even do miracles to back up his word.\n\nYou know there is this old saying \"God will never give you more than you can handle.\"  It's poppycock.  It's ridiculous.  God gives us more than we can handle all the time.  But do you know what - he's there to handle it with us and there is nothing He can't handle.\n\nSo God empowers.  God empowers you to speak in the first place.  He empowers you to keep going when it get's tough.  He empowers you to be bold in the face of enemies.  He empowers you to get up when they knock you down.\n\nBut that's not the greatest thing that happens in this passage.  The greatest thing is...\n\n## God saves\n\nHere is the greatest thing about this story - everywhere Paul went and the gospel was preached - people got saved.  Even when the enemies were hurling rocks and throwing lies - people were believing the gospel and having their lives changed.\n\nSo I ask you - was it worth it?  Was it worth the lies and the danger and the violence?  \n\nSouls are in heaven today that would be in Hell.  I'd say it's worth it.\n\nLet me read Paul's statement in Acts 20 again:\n\n> *\"But none of these things move me, neither count I my life dear unto myself, so that I might finish my course with joy, and the ministry, which I have received of the Lord Jesus, to testify the gospel of the grace of God\"*\n\nPaul looked back at all this and said - I finish my course with joy.  I get to tell people about Jesus and see Jesus change their lives.  Yes.  It's worth it.\n\nChurch - in open Antioch - the gospel works.  In pagan Lystra - the gospel works.  in violent Brazil - the gospel works.  In communist China, the gospel works.  In Godless china - the gospel works. In Mattoon, Illinois - the gospel works.\n\nWill it take courage - yep.  Will their be consquences - you betcha - but one of those consequences will be people getting saved.  That's worth it.\n\nLet's stand and pray.","sermon_mp3":[{"id":"attVKbjUnJtlLfj4N","url":"https://dl.airtable.com/em6AsYKlR0CWAtQbfy61_2016%200522%20sun%20am.mp3","filename":"2016 0522 sun am.mp3","size":34024802,"type":"audio/mp3"}],"series":["recimYIKOri1oFH5g"],"service":"Sunday AM","date":"2016-05-22","bible_text":"Acts 14:1-20","speaker":["reczJXlkg63judAaw"],"published":true,"speaker_name":["Ryan Hayden"],"speaker_bio":["Ryan Hayden has served as the pastor at Bible Baptist since 2011.  He loves simple, direct, Bible based preaching.  He blogs at pastorryanhayden.com and is the host of the podcast \"The Foolishness of Preaching\" as well as a daily devotional radio show."],"speaker_role":["Pastor"],"speaker_thumbnail":[{"id":"attiOBQEp50XuGPhA","url":"https://dl.airtable.com/LJGYxDMRxuJNDVwB8peA_Photo%20on%205-10-16%20at%206.26%20PM.jpg","filename":"Photo on 5-10-16 at 6.26 PM.jpg","type":"image/jpeg","size":52652,"width":375,"height":375,"smallThumbUrl":"https://dl.airtable.com/BvvqdOhNTveYIc1lb8fP_small_Photo%20on%205-10-16%20at%206.26%20PM.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/alezlQj3Qdm6UQIO2DQR_large_Photo%20on%205-10-16%20at%206.26%20PM.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"series_title":["Acts"],"series_description":["On Sunday mornings at Bible Baptist we are looking at the story of the first church and their expansion from a small group of people in Jerusalem to a worldwide movement."],"series_featured_image":[{"id":"attD0DHqFH8EMvReu","url":"https://dl.airtable.com/a2NVzZDAS1S6xmXrofvJ_Acts.jpg","filename":"Acts.jpg","type":"image/jpeg","size":751004,"width":1920,"height":1080,"smallThumbUrl":"https://dl.airtable.com/SaeGMTSM6CPhD1R0dp0A_small_Acts.jpg","smallThumbWidth":64,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/i4y4njq3Tqeo3McczRC9_large_Acts.jpg","largeThumbWidth":256,"largeThumbHeight":144}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"What Christians Need","body_content":"Tonight we are going to go back to the book of Acts.  It's a basic message - really simple.  But I think it's practical.  I think it's something we need to know.\n\nI'm going to let Adam continue in Genesis while I am gone.\n\nLet's read Acts 14:21-28.\n\n> *\"And when they had preached the gospel to that city, and had taught many, they returned again to Lystra, and to Iconium, and Antioch, Confirming the souls of the disciples, and exhorting then to continue in the faith, and that we must through much tribulation aenter into the Kingdom of God.  And when they had ordained them elders in every church, and had prayed with fasting, they commended them to the Lord, on whom thy believed.  And after they had passed throughout Pisidia, they came to Pamphylia.  And when they had preached the word in Perga, they went down into Attalia: And thence sailed to Antioch, from whence they had been recommended to the grace of God for the work which they fulfilled.  And when they were come, and had gathered the church together, they rehearsed all that God had done with them, and how he had opened the door of faith unto the Gentiles.  And there they abode long time with the disciples.\"*\n\n\nThis passage is a kind of summary passage.  It tells us that Paul went to a few other places and then went back and visited the places where they had preached.  It's Paul and Barnabas's missionary journey in reverse.\n\nBut here is the idea, the one idea that you get from these verses - everywhere that Paul went - he left a church.\n\nIn fact, Paul wrote one of the books of the Bible - Galatians, right after this to these people.  Turn with me to Galatians 1.  Hold your finger here and then go there.\n\nLook at verses 1-2:\n\n> *\"Paul, an apostle, (not of men, neither by man, but by Jesus Christ, and God the Father, who raised him from the dead;) And all the brethren which are with me, unto the churches of Galatia\"*\n\nNotice that last phrase of verse 2: *\"To the churches of Galatia\"**\n\nEverywhere Paul has been would be considered \"Galatia\" and he was only in these places for a short time - just a few weeks or a few months - but he left behind churches.\n\nEver read \"Hansel and Gretel\" - you know how as they journeyed through the woods they left breadcrumbs.  Paul is journeying through the whole world and he's dropping churches everywhere he goes.\n\nNow, that should tell you something - and I think we'll make this our first point:\n\n## Christians need church\n\nChurch isn't some something that was made up to take up everyone's time. It's not an optional part of the Christian life.  Paul went around and preached the gospel, and as soon as he had converts he organized churches.  And when he went back through he wasn't visiting individual converts he was visiting individual churches.\n\nYou know, there are some people who think that the church is some kind of social club.  Or that the church is some optional add-on to the Christian life.  They want to buy the whole Christ thing, but they don't want to add the church package - because they don't want to make the weekly payments.  That's not how this works. \n\nSo that's the first thing I want you to see.  That Paul left churches because Christians need churches.\n\nIt's not a perfect analogy and I realize it - but it's mostly true.  You play baseball in the context of a field.  You are an astronaut in the context of outer space.  You live the Christian life in the context of a local church. \n\nSo Paul left all of these churches.  Ok.\n\nAll right, so I want you to think about this for a minute.  It's Ad 45 or something like that.  There are all of these baby churches that have only had Paul with them for a short time. In many cases Paul had to leave them early because of persecution. They are spread out all over the place and can't really fellowship with each other.\n\nThat's kind of a scary spot don't you think.  I mean - these churches are babies.  If I were to take Noah tomorrow and just leave him somewhere along the interstate in central Ohio to fend for himself - that would concern you wouldn't it?  That's almost what was going on with these churches - they were at best toddlers and they were being left to fend for themselves.\n\nSo we know that Christians need churches - what do churches need?\n\nThat's why I wanted to preach on this passage because it gives us three things - three tools that the church has at it's disposal.  \n\nLook again at our passage.  Verses 22-23 give us a kind of overview of how Paul handled these baby churches and what he trusted.  Look at those verses again:\n\n> *\"Confirming the souls of the disciples, and exhorting them to continue in the faith, and that we must through much tribulation enter into the kingdom of God. And when they had ordained them elders in every church, and had prayed with fasting, they commended them to the Lord, on whom they believed\"*\n\nOk, so here is my main point tonight.  My main point is that Paul could leave these churches as baby churches because they had three things.  These are the three things that churches need to stay healthy. They are three things that modern established churches need too.  Ready:\n\nThe first thing churches need is...\n\n## Apostolic Teaching (The Scriptures)\n\nPaul was an apostle, and as an apostle he gave guidance to the early church.  He went about confirming and exhorting the people.  He told them to continue in the faith - which refers to the teaching he gave them.  They needed his guidance.\n\nNow - you might be thinking - Pastor, we don't have apostles today. We don't have someone giving us this kind of apostolic teaching.  You are right.  We don't.\n\nBut we still have access to apostolic teaching.  Apostolic instruction for the church.  Do you know what we have?  Every book of the New Testament is recorded apostolic teaching.  We are reading apostolic teaching now.\n\nListen - the first thing that churches need is the Bible.  They need the New TEstament.  They need to be Bible churches.\n\nWhen Paul wrote a letter to an early pastor - his instruction was clear \"Preach the word.\"  More than programs, more than nice buildings, more than technology - more than any of that what churches need is the Bible.  They need the Bible.\n\nLook - there are much more exciting ways to speak to you than going through the Bible like we do here.  I could make up themes and topics - I do sometimes - and we could have a steady diet of just that and we could really ramp it up.  Or we could bring in some dynamic guy to get everyone jazzed up every week with funny stories.  But the main reason we don't do that, other than I just couldn't pull it off, is because that isn't what you need.  You need the scriptures.\n\nThere are a lot of churches today that I think have gone to the point of license.  They have nothing about them that identifies them as believers.  They live and act just like the world around them.  I don't think that's a good thing.  Do you know what they need?  They need the Bible.\n\nOn the other end of the spectrum are churches that are legalistic.  They are all about the rules.  They've got rules for everything. I was listening to a video the other day and the pastor was just going on and on about rules for this and rules for that.  I don't think that's how God intended them to live the Christian life.  But do you know what they need - they need the Bible.\n\n1 Peter 2:2\n\n> *\"As newborn babes, desire the sincere milk of the word, that ye may grow thereby\"*\n\nPeople need the Lord but people need the word.  That's how Christians grow.\n\nSo these churches had apostolic teaching and we have apostolic teaching.\n\nThe second thing these churches had was...\n\n## Elder Oversight (The Pastorate)\n\nNotice what the text says:\n\n> *\"And when they had ordained them elders in every church\"*\n\nThe second thing that Paul could trust as he left these baby churches alone was what this passage calls \"elders.\"  But these aren't \"elders\" in the sense that they are old.  You don't have to be ordained to be an old person.  These are the pastoral leadership of the church.  Sometimes they are called \"elders\", sometimes they are called \"bishops\", sometimes they are called \"pastors.\"  It's the same group of men, and actually, elder is the most common name in the New Testament. \n\nTurn with me to the book of Titus.  Titus 1. Look at verse 5:\n\n> *\"For this cause left I thee in Crete, that thou shouldest set in order the things that are wanting, and ordain elders in every city, as I had appointed thee\"*\n\nThis is a common thing.  They would start a church and immediately they would ordain the leadership of the church. The elders.  \n\nTurn to 1 Peter 5.  With me.  We'll look at verses 1-3:\n\n> *\"The elders which are among you I exhort, who am also an elder, and a witness of the sufferings of Christ, and also a partaker of the glory that shall be revealed: Feed the flock of God which is among you, taking the oversight thereof, not by constraint, but willingly; not for filthy lucre, but of a ready mind; Neither as being lords over God's heritage, but being ensamples to the flock. And when the chief Shepherd shall appear, ye shall receive a crown of glory that fadeth not away\"*\n\nSo we get a clearer picture of who these guys were.  They were the undershepherds.  They were to feed the flock.  They were to take oversight.  They were to lead by example.  They were pastors.\n\nListen, this is going to sound totally egotistical but I don't mean it to be.  Because I'm not indespesible as your pastor.  Ok.  But here this:  A church isn't a healthy church unless its:\n\n1- A Bible led church\n2- An elder led church\n\nThose are two safeguards and provisions God has given to the church.  The Bible and pastors.  So if a church is going to be healthy they need the Bible and pastors.\n\n---\n\nBut there is one more thing.  Look at verse 23 in our text one more time:\n\n> *\"they commended them to the Lord, on whom thy believed.\"*\n\nSo how could Paul just leave these baby churches?  They had Apostolic teaching - they had the Bible.  They had Pastoral leadership.  But there was one more thing they had, and it's something we overlook.  They had:\n\n## Divine Faithfulness (The Holy Ghost)\n\nListen to me.  Here this.  Please hear this.  God loves Bible Baptist church far more than I ever could.  Far, far more.\n\nEphesians 5:25 says:\n\n> *\"Husbands, love your wives, even as Christ also loved the church, and gave himself for it\"*\n\nJesus loves the church.  If what we have here is a true church - God is going to look out for it.  God is going to take care of it.\n\nOne of the most arrogant things I hear pastors say from time to time is \"This church needs me - I don't know what would happen to this church without me.\"  Ok - I get where they are coming from. Churches do need pastoral leadership - but God cares more about that church if it's a true church than that pastor ever could and God is looking out for it.\n\nChurches, if they are made up of believers, are made up of people who have the Holy Ghost living inside of them - and God will lead them.","sermon_mp3":[{"id":"attSX40dPob0qQMEw","url":"https://dl.airtable.com/bcOkgIJDSYOenuM2GDzX_2016%200522%20sun%20pm.mp3","filename":"2016 0522 sun pm.mp3","size":22089977,"type":"audio/mp3"}],"series":["recimYIKOri1oFH5g"],"service":"Sunday PM","date":"2016-05-22","bible_text":"Acts 14:21-28","speaker":["reczJXlkg63judAaw"],"published":true,"speaker_name":["Ryan Hayden"],"speaker_bio":["Ryan Hayden has served as the pastor at Bible Baptist since 2011.  He loves simple, direct, Bible based preaching.  He blogs at pastorryanhayden.com and is the host of the podcast \"The Foolishness of Preaching\" as well as a daily devotional radio show."],"speaker_role":["Pastor"],"speaker_thumbnail":[{"id":"attiOBQEp50XuGPhA","url":"https://dl.airtable.com/LJGYxDMRxuJNDVwB8peA_Photo%20on%205-10-16%20at%206.26%20PM.jpg","filename":"Photo on 5-10-16 at 6.26 PM.jpg","type":"image/jpeg","size":52652,"width":375,"height":375,"smallThumbUrl":"https://dl.airtable.com/BvvqdOhNTveYIc1lb8fP_small_Photo%20on%205-10-16%20at%206.26%20PM.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/alezlQj3Qdm6UQIO2DQR_large_Photo%20on%205-10-16%20at%206.26%20PM.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"series_title":["Acts"],"series_description":["On Sunday mornings at Bible Baptist we are looking at the story of the first church and their expansion from a small group of people in Jerusalem to a worldwide movement."],"series_featured_image":[{"id":"attD0DHqFH8EMvReu","url":"https://dl.airtable.com/a2NVzZDAS1S6xmXrofvJ_Acts.jpg","filename":"Acts.jpg","type":"image/jpeg","size":751004,"width":1920,"height":1080,"smallThumbUrl":"https://dl.airtable.com/SaeGMTSM6CPhD1R0dp0A_small_Acts.jpg","smallThumbWidth":64,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/i4y4njq3Tqeo3McczRC9_large_Acts.jpg","largeThumbWidth":256,"largeThumbHeight":144}],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Preach it Paul!","body_content":"My kids wanted to watch the movie \"Peobody and Sherman\" with me.  So I watched it with them.  It was cute.  Peobody of course is this genius dog, and Sherman is his adopted son and the story revolves around Peobody's signature invention \"the way back machine.\"  A Time machine.\n\nImagine if you had a \"way back machine\" - what would you want to see?  The Boston Tea Party?  The signing of the declaration of independence?  Martin Luther nailing the 95 thesis to the Wittenberg door?\n\nI know what I would want to see.  I would want to hear the sermons of many famous preachers who have gone on to be with the Lord.  I'd go to London in the 1860s and hear Charles Spurgeon preach. I'd go to Chicago in the 1950s and hear Harry Ironside.  Maybe while I was there I would zip across town and listen to Bob Ketcham preach.  I'd want to see D. Martyn Lloyd Jones in London and Harold Sightler and Vance Havner and A.W. Tozer. Maybe I would even go way way back and hear Jonathan Edwards or George Whitfield.\n\nBut I know two preachers I would definitely want to hear: Jesus and the Apostle Paul.\n\nWe think of the apostle Paul as a preacher, and we should, but do you know that there are only two full length sermons from Paul recorded in Acts?  We are going to look at one of them tonight.  \n\nTurn with me to Acts 13 one more time and we'll look at one of those sermons.  We've already studied this chapter twice, but we skipped over this part.  Let's read verses 16-41\n\n> *\"Then Paul stood up, and beckoning with his hand said, Men of Israel, and ye that fear God, give audience. The God of this people of Israel chose our fathers, and exalted the people when they dwelt as strangers in the land of Egypt, and with an high arm brought he them out of it. And about the time of forty years suffered he their manners in the wilderness. And when he had destroyed seven nations in the land of Chanaan, he divided their land to them by lot. And after that he gave unto them judges about the space of four hundred and fifty years, until Samuel the prophet. And afterward they desired a king:and God gave unto them Saul the son of Cis, a man of the tribe of Benjamin, by the space of forty years. And when he had removed him, he raised up unto them David to be their king; to whom also he gave testimony, and said, I have found David the son of Jesse, a man after mine own heart, which shall fulfil all my will. Of this man's seed hath God according to his promise raised unto Israel a Saviour, Jesus: When John had first preached before his coming the baptism of repentance to all the people of Israel. And as John fulfilled his course, he said, Whom think ye that I am? I am not he. But, behold, there cometh one after me, whose shoes of his feet I am not worthy to loose. Men and brethren, children of the stock of Abraham, and whosoever among you feareth God, to you is the word of this salvation sent. For they that dwell at Jerusalem, and their rulers, because they knew him not, nor yet the voices of the prophets which are read every sabbath day, they have fulfilled them in condemning him. And though they found no cause of death in him, yet desired they Pilate that he should be slain. And when they had fulfilled all that was written of him, they took him down from the tree, and laid him in a sepulchre. But God raised him from the dead: And he was seen many days of them which came up with him from Galilee to Jerusalem, who are his witnesses unto the people. And we declare unto you glad tidings, how that the promise which was made unto the fathers, God hath fulfilled the same unto us their children, in that he hath raised up Jesus again; as it is also written in the second psalm, Thou art my Son, this day have I begotten thee. And as concerning that he raised him up from the dead, now no more to return to corruption, he said on this wise, I will give you the sure mercies of David. Wherefore he saith also in another psalm, Thou shalt not suffer thine Holy One to see corruption. For David, after he had served his own generation by the will of God, fell on sleep, and was laid unto his fathers, and saw corruption: But he, whom God raised again, saw no corruption\"*\n\n> *\"Be it known unto you therefore, men and brethren, that through this man is preached unto you the forgiveness of sins: And by him all that believe are justified from all things, from which ye could not be justified by the law of Moses. Beware therefore, lest that come upon you, which is spoken of in the prophets; Behold, ye despisers, and wonder, and perish:for I work a work in your days, a work which ye shall in no wise believe, though a man declare it unto you\"*\n\nWe can't hear the Apostle Paul preach.  Even if we could, we wouldn't understand it, because he was preaching in Greek and none of us speak Koine Greek.  But we can read what he said.\n\nSo what did Paul preach when he got this great opportunity.  He preached three things, and they are all things we need to still be preaching today.  \n\nLet's pray and I'll give you those three things:\n\n\nThe first thing that we see that Paul preached is...\n\n# 1. Paul preached the Bible.\n\nNotice that...\n\n## His message was a Bible message.\n\nI want you to notice that Paul went through the scripture with this message.  He was just preaching what the Bible said.  In verses 16-23 Paul gives a summary of the whole of Old testament history - up until David.  \n\nPaul was no dummy.  Even secular people who look back at the apostle Paul recognize that the man was brilliant.  He could have used any argument that he wanted to.  He could have gone to philosophy, to current events, to history, to science.  You know from the Bible that Paul knew all of that stuff - but he didn't - he went to the scripture and he drew his message from the scripture.\n\nChurch - listen to me.  It is not the job of the preacher to make you feel good.  It is the job of the preacher to tell you what God's word says.  It's not my job to get up here on Sunday morning and preach to you from Time Magazine or from Reader's Digest.  It's not my job to preach to you about politics or current events.  It's not my job to give you pop psychology. It's the job of the preacher to say \"thus saith the Lord\" and the only place that we can find that is in the scripture.\n\nLook - I have opinions.  I have lots of opinions.  But you don't need my opinions - you need the word of God.  I could tell you stories till you were sick of hearing them - but you don't need stories, you need the word of God.\n\nWhen you judge a sermon - don't judge it by how it made you feel.  Don't judge it by how dynamic the speaker was.  Don't judge it by how much he yelled and screamed and stomped his feet.  Don't judge it by the number of \"amens.\"  Judge it by this and this alone **\"Did the preacher help me to understand better what the Bible says, and do I feel compelled to obey it?\"**\n\n---\n\nHis message was a Bible message.  But notice it wasn't just a message drawn from the Bible...\n\n## His arguments were Bible arguments.\n\nPaul is going to be making arguments about Jesus and who Jesus is.  But with every argument about Jesus being the savior, Jesus being the messiah, Jesus being resurrected, with every one - Paul goes to the scripture and backs up his argument with scripture.\n\nDo you know why?  Because the scriptures have final authority.  The word of God is the word of God.\n\nLook - you can disagree with my opinions.  If I stand up and preach my opinions - and you say \"Ok, pastor, that sounds good and all but I don't agree.\"  There is nothing wrong with that.\n\nBut if I carefully stick to the Bible and I give you what the Bible says and you walk away and say \"I don't agree with that.\" Then you aren't disagreeing with me - you are disagreeing with the Bible.  You are disagreeing with God.\n\nIt's my job not only to help you understand the Bible, it's my job to do so with such clarity and authority that you understand \"this is really what God is saying and I can either obey this or disobey God.\"\n\nThat's preaching with authority.\n\nLook - our authority isn't me yelling.  It isn't me getting all emotional.  Real authority comes when we see \"this is the word of God and we better obey it.\"\n\nSo Paul preached a Bible message.  Church, that's what the world needs to hear from us - the Bible.  It's still as relevant today as it was in Jesus' day.  Fashions may change.  Moral's may change - but this is the book that will last forever.  This book is the anchor that will keep us safe in the troubled seas of modern change. \n\nOn our logo, I don't know if you've noticed this, but there are words that are underneath it. Underneath it it says \"it lives, it speaks, it changes lives.\"\n\nThat's not a reference to our church.  That's a reference to the Bible.  The Bible is the only book that is alive.  \n\nHebrews 4:12 says\n\n> *\"For the word of God is quick, and powerful, and sharper than any twoedged sword, piercing even to the dividing asunder of soul and spirit, and of the joints and marrow, and is a discerner of the thoughts and intents of the heart.\"*\n\nThe word of God is quick - it's alive.  And it speaks to us in a powerful way.\n\nIt's still speaking to the issues of today.  It's still guiding us.\n\nAnd do you know what? It changes lives. You find Jesus in this book, you find truth in this book, it changes lives.\n\nThere is a song I love and it's chorus says:\n\n```\nGod's Word changes lives\nIts power cannot be denied\nThe lost find salvation, the foolish become wise\nGod's Word changes lives\n```\n\nSo Paul preached the Bible.  But there was one specific message from the Bible that Paul wanted people to hear. \n\nNotice that...\n\n#  2. Paul preached Jesus.\n\nIn verse 23 Paul gets where he is going.  He gets to the main point.  Everything else so far has been runway.  But this is what he wants to talk to these people about.  Look what he says:\n\n> *\"Of this man's seed hath God according to his promise raised unto Israel a Saviour, Jesus\"*\n\nPaul preached the Bible - but in order to really understand what the Bible says you have to understand what the Bible is all about - and the Bible is all about Jesus.  Everything from Genesis to Matthew points forward to Jesus.  Matthew, Mark, Luke and John tell the story of Jesus, then everything else looks back at Jesus.  It's all about Jesus.\n\nPeople need the Bible - but more than that, they need the Christ of the Bible. The Bible may be the vehicle for our message - but Jesus IS our message.  Paul said in 1 Corinthians 1:23-24 \n\n> *\"We preach Christ crucified, unto the jews a stumblingblock, and unto the Greeks foolishness, but unto them which are the called, both Jews and Greeks, Christ the power of God and the wisdom of God.\"*\n\nHe said in Romans 1:16\n\n> *\"For I am not ashamed of the gospel of Christ:for it is the power of God unto salvation to every one that believeth; to the Jew first, and also to the Greek\"*\n\nHe said in 2 Corinthians 4:5\n\n> *\"For we preach not ourselves, but Christ Jesus the Lord.\"*\n\nI could go on and on.  Because truly, this is the theme of the whole Bible.  This is what it's all about.  It's all about Jesus.\n\nThis book contains rules - but it's not all about rules.  It contains prophecy - but its not a book about Prophecy.  There is plenty of pithy wisdom in this book - but it's not a self-help book.  It's a book about Jesus.\n\nAnd when Paul got a chance to preach - 10 times out of 10 He was going to preach Jesus.  \n\nSomebody asked Charles Spurgeon, the famous british preacher to describe his method and here is what he said, \"“I take my text and make a bee-line to the cross.”\n\nPaul preached Jesus, but notice in our text HOW he preached Jesus:\n\n## He preached Jesus prophesied. (21-23)\n\nHe went to the Old Testament and went through Old Testament history and as you are reading this you are thinking - ok Paul, where are you going with this.  He was trying to show these people that Christ was prophesied in the Old Testament.  That's what the word \"Christ\" means - it is the same word as \"messiah.\"  Jesus is the promised one.\n\nBut Paul didn't stay there, He told them WHY the Old testament promised Jesus...\n\n## He preached Jesus the savior (23b-29)\n\nIn verses 23 Paul says:\n\n> *\"God according to his promise raised unto Israel a Saviour, Jesus\"*\n\nHe took them to the cross.  He told them that the Jews senselessly took this promised one and killed him in the most unimaginable way possible. But - and you have to think like people who are hearing this for the first time like this audience was - He didn't present it as a bad thing.\n\nThink about this - let me tell you some good news, the person that was promised to save us has come - WooHoo!  Yes!  Ticker tape parade!  Dancing in the streets!  The savior is come!  Yes - and we killed Him!  Woohoo!  Yay!  Wait - why are you not cheering???\n\nImagine how strange that must have sounded to be told messiah had come and that the Jews had killed Him and to be told it with a smile on your face like it's a good thing. \n\nHow could Paul preach Jesus this way?\n\nLook at one more thing?\n\n## He preached Jesus triumphant (30-36)\n\nI know I alrady read a lengthy passage but let me read verses 29-37 again:\n\n> *\"And when they had fulfilled all that was written of him, they took him down from the tree, and laid him in a sepulchre. But God raised him from the dead: And he was seen many days of them which came up with him from Galilee to Jerusalem, who are his witnesses unto the people. And we declare unto you glad tidings, how that the promise which was made unto the fathers, God hath fulfilled the same unto us their children, in that he hath raised up Jesus again; as it is also written in the second psalm, Thou art my Son, this day have I begotten thee. And as concerning that he raised him up from the dead, now no more to return to corruption, he said on this wise, I will give you the sure mercies of David. Wherefore he saith also in another psalm, Thou shalt not suffer thine Holy One to see corruption. For David, after he had served his own generation by the will of God, fell on sleep, and was laid unto his fathers, and saw corruption: But he, whom God raised again, saw no corruption\"*\n\nHere was what Paul was getting at.  Jesus. Jesus has come and He's fulfilled all of the promises. He's come to be our savior.  And He was killed - but He also fulfilled another promise - one you forgot about - He rose from the dead.\n\nHe truly is the Messiah.  He truly is the son of God.\n\n---\n\nNow, I want to stop here.  So Paul preached the Bible - He preached Jesus.  But there is a question every preacher must ask with every message: so what?  What does it matter to me?  How does this effect me?  \n\nLook at the third thing Paul preached and we'll be done:\n\n# 3. Paul preached the need to believe.\n\nLook at verses 38-42:\n\n> *\"Be it known unto you therefore, men and brethren, that through this man is preached unto you the forgiveness of sins: And by him all that believe are justified from all things, from which ye could not be justified by the law of Moses. Beware therefore, lest that come upon you, which is spoken of in the prophets; Behold, ye despisers, and wonder, and perish:for I work a work in your days, a work which ye shall in no wise believe, though a man declare it unto you\"*\n\nPaul didn't leave these people hanging.  He told them what God expected of them and he told them the consequences if they didn't do it.  He told them the best news they could ever hear and then he told them that they needed to act on it. They needed to believe.  \n\n\n","series":["recimYIKOri1oFH5g"],"service":"Sunday AM","slides":[{"id":"attm64Ih4mwCd0nFN","url":"https://dl.airtable.com/gXwV6bLLTpit4CJnH1Vm_Acts%2013-3.pdf","filename":"Acts 13-3.pdf","size":40770097,"type":"application/pdf","thumbnails":{"small":{"url":"https://dl.airtable.com/attm64Ih4mwCd0nFN-28x36.png","width":28,"height":36},"large":{"url":"https://dl.airtable.com/attm64Ih4mwCd0nFN-512x663.png","width":512,"height":663}}}],"handout":[{"id":"attL7wcuAoi60EauZ","url":"https://dl.airtable.com/qJMjdZAkS620uw0LbaAA_Acts%2013-3%20handout.pdf","filename":"Acts 13-3 handout.pdf","size":37543,"type":"application/pdf","thumbnails":{"small":{"url":"https://dl.airtable.com/attL7wcuAoi60EauZ-28x36.png","width":28,"height":36},"large":{"url":"https://dl.airtable.com/attL7wcuAoi60EauZ-512x663.png","width":512,"height":663}}}],"date":"2016-05-15","bible_text":"Acts 13:16-41","speaker":["reczJXlkg63judAaw"],"published":true,"speaker_name":["Ryan Hayden"],"speaker_bio":["Ryan Hayden has served as the pastor at Bible Baptist since 2011.  He loves simple, direct, Bible based preaching.  He blogs at pastorryanhayden.com and is the host of the podcast \"The Foolishness of Preaching\" as well as a daily devotional radio show."],"speaker_role":["Pastor"],"speaker_thumbnail":[{"id":"attiOBQEp50XuGPhA","url":"https://dl.airtable.com/LJGYxDMRxuJNDVwB8peA_Photo%20on%205-10-16%20at%206.26%20PM.jpg","filename":"Photo on 5-10-16 at 6.26 PM.jpg","type":"image/jpeg","size":52652,"width":375,"height":375,"smallThumbUrl":"https://dl.airtable.com/BvvqdOhNTveYIc1lb8fP_small_Photo%20on%205-10-16%20at%206.26%20PM.jpg","smallThumbWidth":36,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/alezlQj3Qdm6UQIO2DQR_large_Photo%20on%205-10-16%20at%206.26%20PM.jpg","largeThumbWidth":256,"largeThumbHeight":256}],"series_title":["Acts"],"series_description":["On Sunday mornings at Bible Baptist we are looking at the story of the first church and their expansion from a small group of people in Jerusalem to a worldwide movement."],"series_featured_image":[{"id":"attD0DHqFH8EMvReu","url":"https://dl.airtable.com/a2NVzZDAS1S6xmXrofvJ_Acts.jpg","filename":"Acts.jpg","type":"image/jpeg","size":751004,"width":1920,"height":1080,"smallThumbUrl":"https://dl.airtable.com/SaeGMTSM6CPhD1R0dp0A_small_Acts.jpg","smallThumbWidth":64,"smallThumbHeight":36,"largeThumbUrl":"https://dl.airtable.com/i4y4njq3Tqeo3McczRC9_large_Acts.jpg","largeThumbWidth":256,"largeThumbHeight":144}],"ten_minutes":0,"updated_or_created_ten_minutes":0}]
